[{"name":"Acidic Drool","description":"As an incidental, spend a dark side Destiny Point to give the toothy bite weapon the Burn 2 quality until the end of the chemilizard’s turn; this is a chemical burn.","type":"abilities"},{"name":"Advanced Language Module","description":"When encountering a new species or language not in its databases, a TC-series protocol droid may make an :easy: Knowledge (Education) check to learn enough of the new dialect to communicate.","type":"abilities"},{"name":"All the Luck in the Galaxy","description":"When making a check to gamble, a Deception check, or a Negotia­tion check, add :force: to the check. Each :lightside: result automatically adds :success: to the check. :darkside::darkside: results automatically add :despair: to the check.","type":"abilities"},{"name":"Alliance Leader","description":"Alliance operatives add :boost: to all Vigilance and Perception checks when in the NPC’s presence.","type":"abilities"},{"name":"Allelochemical Transmitters","description":"May spend :threat: generated by the PCs to allow the Falleen to evoke fear, desire, anger, doubt, confusion, or another emotion in the character targeting him, inflicting 1 Strain per :threat:.","type":"abilities"},{"name":"Ambusher","description":"May determine initiative using Skulduggery instead of Cool or Vigilance","type":"abilities"},{"name":"Ambushers","description":"Targets add :setback::setback: to all checks made to avoid surprise or notice traps when attacked by monkey-lizards.","type":"abilities"},{"name":"Ammonia Breather","description":"Breathes ammonia, must use a respirator, and if exposed to oxygen, treats it as a dangerous atmosphere with rating 8.","type":"abilities"},{"name":"Amphibious","description":"May breathe underwater without penalty and never suffer movement penalties for travelling through water.","type":"abilities"},{"name":"Animal Combatant","description":"Upgrade ability of checks when fighting wild creatures once.","type":"abilities"},{"name":"Aquatic Creature","description":"Suffers no penalties for moving through water and can breathe underwater, but cannot move or survive on land.","type":"abilities"},{"name":"Arboreal Creature","description":"Bearsloths treat trees and branches as normal terrain and do not make checks or spend extra maneuvers in order to move along them vertically or horizontally.","type":"abilities"},{"name":"Asharl Pelt","description":"Remove :setback: on Survival checks due to cold environments.","type":"abilities"},{"name":"Aura of Command","description":"Spend a maneuver to allow one allied minion group at Medium range to immediately perform one maneuver or action. Add :boost: to any actions they perform.","type":"abilities"},{"name":"Awkward","description":"While they have great physical strength their bulk imposes severe limitations in flexibility and agility; they add :setback::setback::setback: to all Brawl, Melee, and Coordination checks they’re required to make.","type":"abilities"},{"name":"Backup Entertainer","description":"When a SDMN Session Droid performs the Assist maneuver to help a character make a check as part of a performance, that character adds automatic :advantage::advantage: to the result.","type":"abilities"},{"name":"Bad Knee","description":"If TH-313 generates :threat::threat::threat: or :despair: on an Athletics, Brawl, or Melee check, he is immobilised for one round.","type":"abilities"},{"name":"Bantha Affinity","description":"Add :boost: to all Survival checks to handle or ride Banthas.","type":"abilities"},{"name":"Barbed Hide","description":"When the creature is hit by a melee attack, the GM can spend :threat::threat: to inflict 1 Wound (ignoring Soak) on the attacker.","type":"abilities"},{"name":"Beast of Burden","description":"Add {ranks} to the creature’s encumbrance threshold.","type":"abilities"},{"name":"Berzerk Rage","description":"Deal +1 damage with Brawl and Melee attacks when suffering any Wounds. When suffering a Critical Injury, deal +2 damage with Brawl and Melee attacks instead.","type":"abilities"},{"name":"Blabber Mouth","description":"Add :setback: to all social skill checks against a monkey-lizard’s owner.","type":"abilities"},{"name":"Bloodfly Sickness","description":"A character who takes damage from a bloodfly bite must make an :average: Resilience check; failure results in 4 damage, ignoring Soak, and the character halves their Strain Threshold, rounding up, until the character spends at least an hour in a bacta tank or undergoes similarly extensive medical treatment (as determined by the GM).","type":"abilities"},{"name":"Brute Strength","description":"May add :advantage: to all Brawn-related skill checks.","type":"abilities"},{"name":"Blessing of the Ancients","description":"Once per game session as an incidental, the elder may have a character within Short range heal 4 wounds.","type":"abilities"},{"name":"Blubber","description":"+1 Soak.","type":"abilities"},{"name":"Bite at Their Heels","description":"When engaged with a target, allies receive :boost: to combat checks made against the engaged target.","type":"abilities"},{"name":"Camouflaged (Snow)","description":"When in snowy environments, add :boost::boost: to all Stealth checks.","type":"abilities"},{"name":"Camouflaged (Jungle)","description":"When in jungle environments, add :boost::boost: to all Stealth checks.","type":"abilities"},{"name":"Cat-Like Acrobatics","description":"Lemurians do not suffer damage from falls from short range. If a Lemurian falls further than short range, it suffers damage for the fall as normal.","type":"abilities"},{"name":"Changeling","description":"As an action may suffer 3 Strain and make an :average: Resilience check. If successful may change appearance to that of any observed Silhoutte 1 character. An observing character must make an opposed Perception vs. Deception check to detect that something is amiss.","type":"abilities"},{"name":"Cloak","description":"Add :setback::setback::setback: to all checks made to spot or track the maalraa (this can include Vigilance checks made for Initiative if the maalraa ambushes a character). Force-sensitive characters ignore this ability.","type":"abilities"},{"name":"Clone Inhibitor Chip","description":"So long as the proper chain of command is observed, upgrade the ability of Leadership checks targeting a clone trooper once.","type":"abilities"},{"name":"Code of Silence","description":"Upgrade difficulty of any checks made to obtain any information from this target about the Karazak Slavers’ Cooperative once.","type":"abilities"},{"name":"Companion Animal","description":"Once per encounter, may make an :easy: Charm check targeting an engaged character; that character recovers 1 Strain per :success:.","type":"abilities"},{"name":"Computer Affinity","description":"The Intrusion Specialist may add :force: to any Computers check or Skulduggery check to analyse or infiltrate a security system. Spend :forcepip: to add :advantage: to the check. Spend :forcepip::forcepip: to add :success: to any Computers check.","type":"abilities"},{"name":"Constabulary Honour","description":"Add automatic {ranks|threat} to all social checks made to convince a constable to act against the best interest of Sullust.","type":"abilities"},{"name":"Constrictor","description":"Opponents affected by the En­snare quality immediately begin suffering the effects of suffocation.","type":"abilities"},{"name":"Cornered Fury","description":"May upgrade one skill die when engaged and outnumbered by enemies.","type":"abilities"},{"name":"Covering Fire","description":"May spend a maneuver to add +1 ranged Defence to up to three allied characters or minion groups within Short range until the end of the next round; this does not stack with multiple uses.","type":"abilities"},{"name":"Create Bacta","description":"Vratix can secrete one litre of bacta per day.","type":"abilities"},{"name":"Creature of Illusion","description":"Combat checks targeting Moraband Sith phantasms always use Willpower in place of the characteristic normally associated with that skill; the Pierce and Breach qualities do not reduce a Sith phantasm’s soak.","type":"abilities"},{"name":"Creature of the Sea","description":"Aiwhas are not capable of operating on land.","type":"abilities"},{"name":"Critical Eye","description":"Gain :boost: on all rolls made to duplicate a familiar document.","type":"abilities"},{"name":"Crushing Grip","description":"Can maintain a grip on an unfortunate target; as long as it has a victim immobilised in its tentacles, it inflicts 2 Strain and 1 Wound at the start of the victim’s turn.","type":"abilities"},{"name":"Crushing Body","description":"Any victim affected by the korrak’s Ensnare quality suffers 2 Strain and 1 Wound ignoring Soak at the beginning of their turn.","type":"abilities"},{"name":"Crystalline","description":"Does not need to breathe and can survive in vacuum and underwater; immune to poisons and toxins.","type":"abilities"},{"name":"Cunning Ambusher","description":"Opponents add {ranks|setback} to Initiative checks using Vigilance.","type":"abilities"},{"name":"Cybernetic Communications","description":"Due to their cybernetic modifications, Ganks can communicate silently with other Ganks.","type":"abilities"},{"name":"Cybernetic Reinforcement","description":"Guavian Death Gang members ignore Stun damage and can survive in vacuum and underwater for ten minutes.","type":"abilities"},{"name":"Cyborg","description":"Does not need to breathe, eat, or drink and can survive in vacuum or underwater; immune to poisons and toxins.","type":"abilities"},{"name":"Darkest Dreams","description":"A Moraband Sith phantasm can spend :advantage::advantage: on a combat check or :threat::threat: on an engaged enemy’s combat check to have the target make an :average-1: fear check; if the target fails, the phantasm transforms into a figure inspired by the target’s greatest fear in addition to any other effects of the failed check.","type":"abilities"},{"name":"Death Lunge","description":"When incapacitated, daly­rakes make one out-of-turn Brawl attack against one opponent with whom they are engaged. This check gains :boost:.","type":"abilities"},{"name":"Demonic","description":"A demon is immune to poison and disease. A demon doubles its soak vs. non-magical attacks.","type":"abilities"},{"name":"Dense Feathers","description":"Immune to the effects of cold and hazardous weather.","type":"abilities"},{"name":"Desert Dweller","description":"When making skill checks Twi’leks may remove :setback: imposed due to arid and hot environmental conditions.","type":"abilities"},{"name":"Detect Force-Sensitivity","description":"The vornskr may make an :average: Perception check to detect all Force-sensitive creatures or characters with a Force rating within Medium range; this ability functions regardless of intervening terrain or material.","type":"abilities"},{"name":"Devastating","description":"Add +40 to Critical injury rolls against opponents.","type":"abilities"},{"name":"Dive Attack","description":"The first attack made during an encounter gains +2 damage and :boost:.","type":"abilities"},{"name":"Dive-bomb","description":"As an action, may make an opposed Coercion check vs. Cool against one character at up to Medium range; on a success, the target is staggered for one round and the falcon moves to engaged with the target; :advantage: may be spent to cause the target to suffer 1 Strain, and :triumph: may be spent to extend the effect of the stagger by 1 round.","type":"abilities"},{"name":"Drain Life","description":"Whenever a shaoryn inflicts damage on a target after Soak, it heals half that many wounds (rounded up).","type":"abilities"},{"name":"Draw Closer (Skysnare)","description":"The skysnare may take a Draw Closer action, making a Brawl combat check against one Silhouette 1 (or smaller) target within Medium range and adding :force::force: to the check. The skysnare may spend :forcepip: before resolving the success or failure of the check to move the target one range band closer to the skysnare (including from Short to Engaged). It may also spend :forcepip: to add :success: to the combat check. If the skysnare cannot move its target to engage it, the combat check automatically misses.","type":"abilities"},{"name":"Droid","description":"Does not need to breathe, eat, or drink and can survive in vacuum or underwater; immune to poisons and toxins.","type":"abilities"},{"name":"Destabilizing Influence","description":"As a maneuver once per encounter, may add :threat: to all subsequent Cool and Discipline checks made by enemies within Medium range for the remainder of the encounter.","type":"abilities"},{"name":"Domesticable","description":"Downgrade the difficulty of checks to train this creature {ranks|times}.","type":"abilities"},{"name":"Domesticated","description":"Difficulty for training this creature is not upgraded.","type":"abilities"},{"name":"Duracrete Plating","description":"Melee and ranged attacks targeting it gain :setback: due to its armored carapace (included in Defence rating); characters may aim to hit weak spots and ignore 1 Soak.","type":"abilities"},{"name":"Energy Parasite","description":"Mynocks can make an :average: Coordination check to latch onto any starship or vehicle they are engaged with. Ships or vehicles with a mynock attached suffer 1 System Strain per mynock each day and reduce their han­dling by 1.","type":"abilities"},{"name":"Enhanced Senses","description":"Add :advantage: to any Perception checks.","type":"abilities"},{"name":"Enhanced Nemesis Combat","description":"Add an additional NPC Initiative slot at the end of the Initiative order. The nemesis may take a second turn during the same round in this slot. Any effects that are supposed to end during his next turn end instead during his next turn in the following round.","type":"abilities"},{"name":"Envenomed Bite","description":"Whenever the bearsloth suc­cessfully attacks a target (whether or not it deals damage), the GM may flip a dark side Destiny Point to have the target suffer the effects of being exposed to bearsloth venom.","type":"abilities"},{"name":"Etiquette and Protocol","description":"Protocol droids allow allies to add :boost: to any Negotiation checks or other checks made to negotiate or mediate.","type":"abilities"},{"name":"Etiquette and Protocol (Improved)","description":"Protocol droids allow allies to add :boost: to any Negotiation checks or other checks made to negotiate or mediate, no matter the species involved.","type":"abilities"},{"name":"Excellent Climber","description":"Once per game session, the thaelo may reroll any one Athletics check made when climbing.","type":"abilities"},{"name":"Fearsome Aspect","description":"Add :boost: to all Coercion checks.","type":"abilities"},{"name":"Fearsome Countenance","description":"Add automatic :advantage: to Coercion checks.","type":"abilities"},{"name":"Fire Sweep","description":"As an action, can make a :hard: ranged combat check to inflict one hit that deals base damage with its built-in twin blasters on up to two targets within Medium range, plus one additional target per :advantage: on the check; it can only hit each target once this way.","type":"abilities"},{"name":"Fireborn","description":"Does not suffer damage from natural heat or flame, and doubles its soak against magical fire.","type":"abilities"},{"name":"Firefighter","description":"May make an :average: Athletics check to extinguish a fire; success extinguishes the fire within a number of rounds determined by the GM, and additional successes may reduce the time needed to extinguish the fire. Particularly large or dangerous fires may require more difficult checks at the GM’s discretion.","type":"abilities"},{"name":"Fire Resistant","description":"Immune to fire damage or damage from weapons with the Burn quality.","type":"abilities"},{"name":"Force Hunter","description":"Gain :boost: to all combat checks made against Force-sensitive creatures or characters with a Force rating.","type":"abilities"},{"name":"Frightening Visage","description":"As an ac­tion, may make an opposed Deception check vs. Vigilance (when multiple opponents are present, the best Vigilance skill determines difficulty) to create illusion of greater size and threat. If the snowfeather succeeds, all opponents present must make a :hard: fear check. Force-sensitive characters add :setback: to the fear check; droids and other characters immune to Force powers automatically pass the check.","type":"abilities"},{"name":"Force Mimic","description":"At the GM’s discretion, the kaaten may make an opposed Charm or Deception versus Vigilance check as an action to pretend to be a friend, companion, loved one, or of the same spe­cies as its target. When doing so, add :force: to the check; :lightside: results add :success: to Charm checks, while :darkside: results add :success: to Deception checks. If the check succeeds, the illusion is successful, though what effect this has on gameplay depends on the situation and can be determined by the GM. Targets immune to Force powers are immune to these effects.","type":"abilities"},{"name":"Intimidating Presence","description":"All enemies within Short range add :threat: to all skill checks they make.","type":"abilities"},{"name":"Immobile","description":"Cannot spend maneuvers to move.","type":"abilities"},{"name":"Invoke Doellin","description":"Once per encounter, the Doellinist High Priest may re-roll a social skill check that targeted a Gran character.","type":"abilities"},{"name":"Many-armed","description":"The creature gains :boost: on all Brawl checks and may spend :advantage::advantage: on a successful melee attack to hit a second target Engaged with it, dealing the same damage as dealt to the original target.","type":"abilities"},{"name":"Fecklen Boom","description":"As an action, may make an :easy: Survival check; each :success: causes one target in Medium range to be disoriented for 1 round. Each :advantage::advantage: extends the number of rounds by 1 (a disori­ented target adds :setback: to all skill checks performed).","type":"abilities"},{"name":"Fearless","description":"Immune to the effects of fear.","type":"abilities"},{"name":"Fierce Pounce","description":"If the creature uses the Aim maneuver, it also gains Knockdown on its next attack.","type":"abilities"},{"name":"Flyer","description":"This creature can fly.","type":"abilities"},{"name":"For Quolas!","description":"As an action, make an :average: Leadership check to add :boost: to all combat checks by allies within Short range for one round.","type":"abilities"},{"name":"Sathari Glider","description":"A Sathari can glide over small dis­tances while falling and does not suffer damage from falling while conscious.","type":"abilities"},{"name":"Glider","description":"Varactyls can suffer 2 strain to count as a flyer for the remainder of the turn.","type":"abilities"},{"name":"Gun Crew","description":"For each Imperial Gunnery Corps member in the minion group beyond the first, reduce the Cumbersome rating of their weapons by 1.","type":"abilities"},{"name":"Hard to Kill","description":"The GM may flip one dark side Destiny Point to have the Kintan Strider heal 5 Wounds.","type":"abilities"},{"name":"Hardy","description":"Murra add :boost: to all Resilience checks.","type":"abilities"},{"name":"Heat Resistance","description":"Remove up to :setback: from any checks due to hot or arid environmen­tal conditions.","type":"abilities"},{"name":"Heightened Sense of Smell","description":"Razhak upgrade all Perception checks once.","type":"abilities"},{"name":"Helium Allergy","description":"When exposed to helium mynocks suffer 1 Wound per round ignoring Soak until their bodies inflate and explode.","type":"abilities"},{"name":"Hover","description":"May reduce speed to 0 and remain aloft.","type":"abilities"},{"name":"Hoverer","description":"Hovering creatures ignore difficult or impassable terrain as long as they can reasonably stay above it, and they ignore the penalties for moving through water. They generally have to stay relatively close to the ground (within medium range) unless noted otherwise.","type":"abilities"},{"name":"Huttese","description":"Hutt security droid neither speaks nor understands Basic.","type":"abilities"},{"name":"Humming Vibrations","description":"As an action, may make an opposed Charm vs. Discipline check against a target at up to Medium range to disorient the target for a number of rounds equal to :success:; may spend :advantage::advantage::advantage: or :triumph: to stag­ger the target for 1 round instead.","type":"abilities"},{"name":"Imperial Valour","description":"May perform a maneuver to cause all ranged attacks targeting the character to instead hit one ally or helpless enemy in Engaged range, until the beginning of the character’s next turn.","type":"abilities"},{"name":"Imperial Haughtiness","description":"When a non-humanoid alien species is targeting Grayson with a social skill, add :setback:.","type":"abilities"},{"name":"Improved Covering Fire","description":"When allied minion groups within Short range perform the Covering Fire maneuver, they add +2 Ranged Defence instead.","type":"abilities"},{"name":"Infravision","description":"Remove :setback: imposed due to light­ing conditions.","type":"abilities"},{"name":"Ink Spray","description":"Once per encounter, as an out-of-turn incidental, a Quarren may spit ink from a specialised sac within their gills, suffering 2 Strain to add :setback: to a combat check made by a character within Short range (under water, it adds :setback::setback::setback: to the combat check instead).","type":"abilities"},{"name":"Insectoid Appear­ance","description":"LOM-series protocol droids allow allies to remove :setback: from Nego­tiation checks or other checks made to negotiate or mediate when dealing with insectoid species.","type":"abilities"},{"name":"Jet booster","description":"Allows this character to fly, as per the rules in the Flying sidebars in Chapter VI: Conflict and Combat in the core rulebooks.","type":"abilities"},{"name":"Jungle Hunter","description":"Sludge panthers suffer no penalties when moving through rough terrain in dense jungle, dense forest, or swampy environments.","type":"abilities"},{"name":"Keen Senses","description":"Thanks to their finely honed senses of sight and hearing, they gain :boost: on all Perception checks.","type":"abilities"},{"name":"Leap (Star Wars)","description":"Add :boost::boost: to all Athletics checks made to perform vertical or horizontal jumps.","type":"abilities"},{"name":"Leader","description":"All subordinates within Medium range add :boost: to all Discipline checks.","type":"abilities"},{"name":"Lightning Charge","description":"Once per encounter, can use a maneuver to move to Engaged with a target at Medium range; any melee attacks made by the beast or its rider against that target this turn add 2 damage.","type":"abilities"},{"name":"Light-Sensitive","description":"Defel are vulnerable to bright lights, which cause them intense pain and temporary blindness if v1ewed without protection. A Defel exposed to bright light without protective goggles suffers :setback::setback: on all skill checks.","type":"abilities"},{"name":"Living Shadow","description":"Add :setback::setback: to all combat checks and Perception checks against phantasmal beasts of Morabandand and :boost::boost: to all Stealth checks the beasts make, in addition to any dice gained for darkness; applies even to characters not hampered by normal darkness.","type":"abilities"},{"name":"Long Arms","description":"The grey bear’s arms are surprisingly long and nimble, removing :setback: imposed on its combat checks due to an opponent’s defence.","type":"abilities"},{"name":"Lorekeeper","description":"Remove {ranks|setback} from all Knowledge: Lore checks.","type":"abilities"},{"name":"Low-Tech User","description":"Upgrade the difficulty of checks to use unfamiliar technology once.","type":"abilities"},{"name":"Loyalty","description":"Upgrade the difficulty of social checks targeting the Vodran enforcer once if they conflict with the Vodran enforcer’s loyalty or interfere with his duty to his Hutt masters.","type":"abilities"},{"name":"Loyalty Imprint","description":"Add :boost: lo all checks made to defend its designated master.","type":"abilities"},{"name":"Magic Resistance","description":"Upgrade the difficulty of any magic skill check targeting this adversary {ranks|times}.","type":"abilities"},{"name":"Luck Be a Lady","description":"Once per encounter, Lando may reroll a skill check.","type":"abilities"},{"name":"Magnetic Sense","description":"All Devlikk gain :boost: on any Coordination or Piloting checks and know which way is north at all times.","type":"abilities"},{"name":"Mandalorian Visage","description":"Add :success: to the result of Coercion checks to intimidate if Kad is wearing his Mandalorian heavy battle armour.","type":"abilities"},{"name":"Military Analyst","description":"M-3PO-series military protocol droids allow allies to add :boost: to any Knowledge (Warfare) checks that benefit from an understanding of logistics or military procedure.","type":"abilities"},{"name":"Multiattack","description":"Does not need to increase the difficulty of combined combat checks to attack with two weapons.","type":"abilities"},{"name":"Natural Camouflage","description":"Any Perception checks made to detect the creature suffer :setback::setback:; this affects scanners and macrobinoculars using thermal sensors or passive light amplification as well.","type":"abilities"},{"name":"Near-Sighted","description":"Add :setback: to ranged attacks and vision-based Perception checks at long and extreme range.","type":"abilities"},{"name":"Negate Force Powers","description":"An adult ysalamir creates a spherical zone extending out to Short range, inside which Force-sensitive characters and creatures cannot exert influence over the Force. Inside this zone, any Force powers, Force talents, or other abilities that the GM decides work via the Force do not function. Likewise, such powers may not affect or detect any­thing within this zone.","type":"abilities"},{"name":"Networking","description":"For every three DUM-series droids in a group, add :boost: to all Computers, Mechanics, and Perceptions checks.","type":"abilities"},{"name":"Neurotoxin Doses","description":"The Imperial assassin has multiple doses of neurotoxin, which can be introduced into food or drink, or applied to a Melee weapon as a maneuver; if applied to a weapon, it lasts for the remainder of the encounter; if a target ingests poisoned food or drink, or suffers wounds from a poisoned Melee weapon, the target must make an :average: Resilience check; if failed, the target suffers 5 Wounds, plus 1 Strain per :threat:; :despair: means the target must test against the poison again at the start of the next turn.","type":"abilities"},{"name":"Neurotoxin","description":"If a target suffers wounds from a kouhun’s mandible attack, the target must make an :average: Resilience check. The target suffers 5 Wounds if he fails, plus 1 Strain per :threat:; :despair: means the target must check against the poison again at the start of his next turn.","type":"abilities"},{"name":"Nightvision","description":"Remove all :setback: added to checks due to low-light conditions or darkness.","type":"abilities"},{"name":"Olfactory Perception","description":"Gain :boost: on all Sur­vival checks made to track prey, and adds :setback: to enemy Stealth checks made against the vrblthers.","type":"abilities"},{"name":"Olfactory Sensor Suite","description":"Reduces the difficulty of scent-based Perception checks by 1.","type":"abilities"},{"name":"Ornery","description":"Add :setback::setback: to all checks made to handle, domesticate, or otherwise work with a nerf.","type":"abilities"},{"name":"Overrun","description":"The ronto may spend :advantage: to hit an additional target with a successful Brawl check, provided the additional target is engaged with the first target. ","type":"abilities"},{"name":"Pack Instincts","description":"When performing the assist maneuver, grant :boost::boost: instead of :boost:.","type":"abilities"},{"name":"Paralysing Neurotoxin","description":"If the korrak hits its target with a bite attack, the target must immediately make a :hard: Resilience check; failure means the target is immobilised for 1 round, plus 1 round per :threat: generated; :despair: on a successful or failed check means the target is staggered for one round.","type":"abilities"},{"name":"Pheromone Communication","description":"Weequay may communicate with other Weequay using pheromones if they are within Short range of each other.","type":"abilities"},{"name":"Plated Hide","description":"Add {ranks|setback} to all combat checks against this target.","type":"abilities"},{"name":"Poisonous","description":"Any creature that successfully hits the amphibipole with a successful unarmed attack must succeed at a :hard: Resilience check or be poisoned, suffering 3 Wounds at the beginning of the turn for the next three rounds (this ignores Soak).","type":"abilities"},{"name":"Poisonous Bite","description":"Anyone bitten by a Savrip must succeed at an :average: Resilience check or lose their free maneuver for five rounds.","type":"abilities"},{"name":"Ponderous","description":"Can never spend more than one maneuver moving per turn.","type":"abilities"},{"name":"Ponderous (Thalassian)","description":"Without their repulsor packs Thalassians can never spend more than one maneuver moving per turn.","type":"abilities"},{"name":"Photonic Burst","description":"Once per encoun­ter as an action, photon spider can unleash a pulse of light from its body; all targets within Short range are disoriented for two turns.","type":"abilities"},{"name":"Pirate Leader","description":"May perform a maneuver to give orders to other pirate allies in Medium range, granting them :boost: on their next check.","type":"abilities"},{"name":"Pre-emptive Avoidance","description":"Immediately after an opponent moves to engage an albek, the albek may spend one Destiny Point to disengage from the opponent as an out of turn incidental.","type":"abilities"},{"name":"Reckless Strike","description":"As an incidental, once per round, the GM may have the Kintan Strider reroll a Brawl or Melee check; if he does so, the Kintan Strider loses the benefits of the Adversary and Durable talents until the beginning of its next turn.","type":"abilities"},{"name":"Regeneration (Star Wars)","description":"When recovering from wounds via natural rest or in a bacta tank, recover 1 additional Wound; first-aid, medical treatment, and stimpacks do not result in recovery from an additional wound; Trandoshans can regrow lost limbs, though it usually takes at least a month before such limbs are usable.","type":"abilities"},{"name":"Resilient Metabolism","description":"Add :success: to any Resilience checks.","type":"abilities"},{"name":"Restraint","description":"Increase the difficulty of a Melee or Ranged: Light attack check by one in order to in­flict Stun damage and gain the Knockdown quality; spend :advantage: to grant this ability to a Quolas guard minion group at Short range for one round.","type":"abilities"},{"name":"Rhetoric Mimic","description":"May make Charm, Deception, and Negotiation checks using the characteristics of its master; such checks suffer :setback::setback: due to the imperfect mimicry, and the droid does not benefit from any relevant talents its master possesses.","type":"abilities"},{"name":"Sand Walker","description":"Remove :setback: from any checks made to traverse sandy or desert terrain.","type":"abilities"},{"name":"Searing Touch","description":"When an opponent ends its turn engaged with the razhak, the opponent suffers 2 Wounds and 2 Strain.","type":"abilities"},{"name":"Scorching Touch","description":"When an opponent ends its turn engaged with the fissrit, the opponent suffers 1 Wound and 1 Strain.","type":"abilities"},{"name":"Self-destruct Mechanism","description":"Should the probe droid’s mission become compromised, it may self-destruct as an out of turn incidental; this explosion does 10 damage to Engaged characters.","type":"abilities"},{"name":"Sensor Masking","description":"Upgrade the difficulty of checks to detect or analyse the droid with electronic equipment or sensors once.","type":"abilities"},{"name":"Sessile","description":"This creature is unable to perform Move maneuvers.","type":"abilities"},{"name":"Shadowed","description":"When in darkness or deep shadow, add :boost::boost: to all Stealth checks.","type":"abilities"},{"name":"Shadowblend","description":"Upgrade the difficulty once when spotting or targeting runderen that are in darkness.","type":"abilities"},{"name":"Shield Projector","description":"Maneuver to activate or deactivate; while active, gains Defence 2 and upgrades the difficulty of all combat attacks targeting the droideka once, but droideka cannot use the move maneuver.","type":"abilities"},{"name":"Shriek","description":"A minion group of four or more blismal can set up a shrieking racket as an action. All targets within Close range must make a :hard: Resilience check. Failure causes a target to suffer 4 Strain and become disoriented until the noise stops. Characters in sealed armour or who are wearing ear protection are not affected.","type":"abilities"},{"name":"Sight Hunter","description":"Ibbots decrease the difficulty of any Perception or Vigilance checks they make by one.","type":"abilities"},{"name":"Silent Hunter","description":"Opponents suffer :setback::setback: on any Perception or Vigilance checks made to detect a sand panther while it is hunting.","type":"abilities"},{"name":"Silhouette","description":"The difficulty of an attack made against a character 2 silhouettes larger than the attacker is decreased by 1. The difficulty of an attack made against a character 2 or more silhouettes smaller than the attacker is increased by 1.","type":"abilities"},{"name":"Skilled Cheater","description":"Once per session when gambling, the character may cancel a :despair: he rolls on a skill check, or add a :despair: to another character’s check.","type":"abilities"},{"name":"Slave Authority","description":"May use Coercion in place of Leadership when commanding slaves.","type":"abilities"},{"name":"Spaceport Leader","description":"Spaceport staff add :boost: to all Vigilance and Perception checks when in the Spaceport Administrator’s presence.","type":"abilities"},{"name":"Spider Climb","description":"The Lemurian can climb difficult surfaces, including upside down on ceilings, without penalty.","type":"abilities"},{"name":"Soothing Song","description":"The jubba bird may make an :average: Charm check to heal 1 Strain per :success: from all creatures within Medium range.","type":"abilities"},{"name":"Standing Leap","description":"As a maneuver, the Lemurian may jump up to short range in any direction, including straight up.","type":"abilities"},{"name":"Sticky Saliva","description":"Knytix produce viscous saliva that can be used as an adhesive.","type":"abilities"},{"name":"Stinky","description":"While within Short range of a Huttlet, non-Hutt char­acters reduce their Strain thresholds by 2.","type":"abilities"},{"name":"Strong as a Jakobeast","description":"Jako­beasts have an encumbrance threshold of 20.","type":"abilities"},{"name":"Strong as a Murra","description":"Murra have an encumbrance threshold of 25, and the difficulty of all Athlet­ics checks made to lift excessive encumbrance is reduced by one.","type":"abilities"},{"name":"Stubborn","description":"Upgrade the difficulty of checks to train eopies by one.","type":"abilities"},{"name":"Stubborn and Dependable","description":"Remove :setback: from all checks Ugnaught mechanics perform.","type":"abilities"},{"name":"Suited to the Cold","description":"Immune to the effects of freezing and cold environments.","type":"abilities"},{"name":"Suited to the Heat","description":"Immune to the effects of heat and hot environments.","type":"abilities"},{"name":"Supremely Terrifying","description":"Upon first seeing a sando aqua monster, an individual must make a :daunting-1: fear check to reflect the sheer dread the beast invokes.","type":"abilities"},{"name":"Surefooted","description":"Suffer no penalties when moving through difficult terrain.","type":"abilities"},{"name":"Surgeon’s Aid","description":"When a minion group of one or more Mini-Meds performs the Assist maneuver to help a character with a Medicine check, that character counts as having +1 rank in the Surgeon talent per Mini-Med in the group.","type":"abilities"},{"name":"Swarm","description":"Halve the damage dealt to the swarm before applying Soak unless the weapon has the Blast or Burn quality, regardless of whether or not that quality is activated.","type":"abilities"},{"name":"Sweep Attack","description":"The creature can spend :triumph: on a successful Brawl check to hit the target as well as anyone engaged with the target.","type":"abilities"},{"name":"Swipe","description":"Spend :advantage: during melee combat to cause an engaged opponent to suffer 1 Strain.","type":"abilities"},{"name":"Tactical Direction","description":"May perform a maneuver to direct one allied minion group within Medium range; the group may perform an immediate free maneuver or add :boost: to its next check.","type":"abilities"},{"name":"Trained Mount (Star Wars)","description":"Add {ranks|boost} to a rider’s Survival checks while mounted.","type":"abilities"},{"name":"Trample","description":"If the creature takes a maneuver to move closer to its target before attacking, it gains :boost: to its attack check and deals +2 damage.","type":"abilities"},{"name":"Territorial","description":"Spukami are incredibly territorial, and gain :boost: to all Brawl checks made when attacking any intruders into what they consider their territory.","type":"abilities"},{"name":"Teamwork","description":"Add :boost: to all checks during combat while within Medium range of one or more clone trooper allies.","type":"abilities"},{"name":"Terrifying","description":"Upon first sight, an individual must make a fear check with a difficulty equal to the adversary's ranks in Terrifying.","type":"abilities"},{"name":"Terrifying Howl","description":"Anyone hearing the howl of a wrix must make a :hard: Discipline check or become disoriented for one round plus one additional round for every :threat: generated; spend :despair: to stagger the target for one round.","type":"abilities"},{"name":"Tunnelling (Star Wars)","description":"Using their powerful maws and their quick-acting acidic saliva, tunnel worms can move through solid stone as if it were difficult terrain.","type":"abilities"},{"name":"Unstable","description":"When thrantas suffer a Critical Injury, they add {ranks|multiply-10} to the Critical Injury roll.","type":"abilities"},{"name":"Overwhelming Fire","description":"May perform a maneuver to direct one allied minion group within Medium range; the group may perform an immediate free combat check action.","type":"abilities"},{"name":"Vacuum Dweller","description":"Can survive in vacuum without penalty and can move in a vacuum environment.","type":"abilities"},{"name":"Venomous","description":"Anyone who suffers damage from the Sand Panther must immediately make an :average: Resilience check, suffering 5 Strain on failure; any :threat: generated on the Resilience check adds :setback: to all of the target’s actions for a number of rounds equal to the :threat: generated; :despair: can be spent to make the target test against the venom during the next round.","type":"abilities"},{"name":"Vulnerable to Blasts","description":"Add :boost::boost: to checks made with weapons with the Blast quality targeting minion groups of butterbug remotes.","type":"abilities"},{"name":"Wilderness Valor","description":"Add :boost::boost: to resist fear against wild creatures.","type":"abilities"},{"name":"Wookiee Rage","description":"Deal +1 damage with Brawl and Melee attacks when suffering any Wounds. When suffering a Critical Injury, deal +2 damage with Brawl and Melee attacks instead.","type":"abilities"},{"name":"Technical Master","description":"All subordinates within Medium range add :boost: to all Mechanics checks.","type":"abilities"},{"name":"Mountain Nikto","description":"Add 1 rank in Survival and the Natural Outdoorsman talent (once per game session, a Mountain Nikto may reroll any one Resilience or Survival check).","type":"abilities"},{"name":"Pale Nikto","description":"Add 1 rank in Athletics. A Pale Nikto never suffers movement penalties for travelling through water and can hold his breath for a number of rounds equal to twice his Brawn rating before beginning to drown.","type":"abilities"},{"name":"Green Nikto","description":"Add 1 rank in Coordination and a Green Nikto may add :boost: to checks to climb. Additionally, add claws as an unarmed attack.","type":"abilities"},{"name":"Red Nikto","description":"Add 1 rank in Resilience. When making skill checks, a Red Nikto may remove :setback: imposed due to arid or hot environmental conditions.","type":"abilities"},{"name":"Southern Nikto","description":"Add 1 rank in Perception. A Southern Nikto may add :boost: to Perception and Vigilance checks to detect sound.","type":"abilities"},{"name":"Death Sight","description":"When making skill checks, this adversary removes all :setback: imposed due to darkness","type":"abilities"},{"name":"Undead","description":"Does not need to breathe, eat, or drink, and can survive underwater; immune to poisons and toxins","type":"abilities"},{"name":"Spirit","description":"Does not need to breathe, eat, or drink, and can survive underwater; immune to poisons and toxins","type":"abilities"},{"name":"Incorporeal","description":"May move over or through terrain (including doors and walls) without penalty. Halve the damage dealt to this adversary before applying soak, unless the attack came from a magical source such as a spell or magical weapon","type":"abilities"},{"name":"Ghostly","description":"May move over or through terrain (including doors and walls) without penalty. Halve the damage dealt to this adversary before applying soak, unless the attack came from a magical source such as a spell or legendary weapon","type":"abilities"},{"name":"Life Drain","description":"Each time a target is wounded by this adversary, it must make a :hard: Resilience check or have its Wound and Strain threshold reduced by two until the next sunrise. If either threshold is reduced to zero, the target dies. It will rise as a spectre or zombie under the control of its killer at the next nightfall","type":"abilities"},{"name":"Sunlight Vulnerability","description":"When exposed to natural sunlight, this adversary suffers 2 Wounds per turn until it is out of the sunlight. If reduced to zero Wounds, it collapses","type":"abilities"},{"name":"Vampire Regeneration","description":"At the beginning of its turn, this adversary automatically heals 3 wounds, unless it is in direct sunlight","type":"abilities"},{"name":"Vampire's Embrace","description":"A vampire that Ensnares its target with its Claws attack may spend 2 Advantage or Triumph to make a Bite attack against the target. If the bite attack is successful, the vampire heals damage equal to the damage inflicted after soak","type":"abilities"},{"name":"Wall Crawler","description":"May move along walls or ceilings without penalty","type":"abilities"},{"name":"Embalmed Toughness","description":"Immune to piercing non-magical weapons, and double soak against other non-magical weapons.","type":"abilities"},{"name":"Master Sorcerer","description":"May maintain concentration on one spell per turn as an incidental","type":"abilities"},{"name":"Brutal Opportunist","description":"Add :boost: on combat checks and +1 damage against a target that has not yet taken their turn in the current encounter","type":"abilities"},{"name":"Colossal","description":"Reduce any critical injury result suffered by 30, to a minimum of 1","type":"abilities"},{"name":"Sweeping Attack","description":"Does not need to increase the difficulty of a combat check by 1 to use auto-fire","type":"abilities"},{"name":"Trained Mount","description":"Add {ranks|boost} to a rider’s Riding checks while mounted.","type":"abilities"},{"name":"Sweep","description":"The creature can spend :advantage::advantage: on a successful Brawl check to hit an additional target that is Engaged with the first target","type":"abilities"},{"name":"Improved Sweep","description":"The creature can spend :advantage: on a successful Brawl check to hit an additional target that is Engaged with the first target","type":"abilities"},{"name":"Improved Multiattack","description":"The creature does not increase the difficulty of combined checks to attack with any number of its weapons, and may spend 1 Advantage or Triumph to hit with each additional weapon","type":"abilities"},{"name":"Destructive","description":"Add +20 to Critical injury rolls against opponents.","type":"abilities"},{"name":"Construct","description":"Does not need to breathe, eat, or drink, and can survive in vacuum and underwater; immune to poisons and toxins","type":"abilities"},{"name":"Impact Vulnerability","description":"Increase soak by 2 against slashing or piercing weapons, but hammers, maces, flails, or greataxes deal +2 damage per hit","type":"abilities"},{"name":"Fire Absorption","description":"Takes no damage for magical or non-magical fire. If attacked with fire, resolve the attack as normal, but this adversary heals a number of wounds equal to the damage dealt","type":"abilities"},{"name":"Swarm","description":"Halve the damage dealt to the swarm before applying soak, unless the weapon has the Blast or Burn quality [regardless of whether the quality is activated]","type":"abilities"},{"name":"Teeming Threat","description":"As a maneuver, a swarm may engage all living targets within Short range, and take an attack action against each target","type":"abilities"},{"name":"Darkvision","description":"When making skill checks, remove up to :setback::setback: due to darkness.","type":"abilities"},{"name":"Hover","description":"This creature can hover.","type":"abilities"},{"name":"Leap","description":"As a maneuver, may engage a target on the ground from any point within Medium range","type":"abilities"},{"name":"Voracious","description":"Enemies who are Engaged with this swarm at the start of their turn must make a :hard: Resilience check as an incidental or suffer 4 wounds","type":"abilities"},{"name":"Tunneling","description":"Can burrow through the earth as normal movement, and can burrow through rocky earth as difficult terrain. Cannot burrow through solid stone.","type":"abilities"},{"name":"Swoop Attack","description":"After making a Brawl combat check while flying, can move from engaged to short range of the target as an incidental.","type":"abilities"},{"name":"Tremorsense","description":"As long as this adversary is in contact with the ground, it cannot be blinded or deafened, and is unaffected by light conditions","type":"abilities"},{"name":"Iceborn","description":"Does not suffer damage from natural cold or ice, and doubles soak for purposes of reducing damage from magical cold","type":"abilities"},{"name":"Rampage","description":"If this adversary incapacitates an enemy, it may immediately attack another engaged target","type":"abilities"},{"name":"Paralyzing Touch","description":"A living target hit by this creature's claws must make an :average: Resilience check. If it fails, it is staggered until the end of the encounter. At the end of each of its turns, it may attempt another :average: Resilience check to escape the effect. Divine Healing may also undo the effect.","type":"abilities"},{"name":"Slime","description":"Immune to blindness, deafness, any mind-affecting ability or skill, acid, or knockdown","type":"abilities"},{"name":"Threatening","description":"When providing assistance on another character's Coercion checks, add :success: to results for each minion in the group beyond the first.","type":"abilities"},{"name":"Direct Access","description":"When jacking in from within the same building as the target server, automatically succeeds when making an access system check.","type":"abilities"},{"name":"Bioroid","description":"Does not need to breathe, eat, or drink; can survive in vacuum and underwater; is immune to poisons and toxins; and cannot knowingly endanger humans.","type":"abilities"},{"name":"Telepresence","description":"Can operate independently, or can be controlled directly by an operator via wireless link; if being controlled, the drone counts as having ranks in any skill equal to the controller's ranks in that skill.","type":"abilities"},{"name":"Leading Question","description":"Once per encounter, may spend a Story Point to learn one Motivation of any one other character in the encounter.","type":"abilities"},{"name":"Corporate Oversight","description":"When performing the assist maneuver, add :success::threat::threat: to the result instead of adding :boost:.","type":"abilities"},{"name":"Lawful Authority","description":"Add :success: to the results of any social skill checks made when interacting with residents of New Angeles.","type":"abilities"},{"name":"Psychic","description":"As a maneuver may make and :average: Vigilance check to learn the surface thoughts of all other characters in medium range.","type":"abilities"},{"name":"Mob Mentality","description":"Add :boost: to all checks this character makes if part of a group of three or more minions.","type":"abilities"},{"name":"Apparent Precognition","description":"Once per encounter when making a combat check, may use Discipline and Willpower instead of the normal skill and characteristic.","type":"abilities"},{"name":"Charismatic Menace","description":"Allies within short range add :advantage: to checks they make; opponents within short range add :threat: to checks they make.","type":"abilities"},{"name":"Let's Make a Deal","description":"If this character knows an opponent's Desire Motivation, when they inflict strain on the opponent, the opponent suffers 4 additional strain.","type":"abilities"},{"name":"Momentum","description":"If this character performs a move maneuver, they add +3 to the damage of one hit of any successful Brawl or Melee combat checks they make during the same turn.","type":"abilities"},{"name":"Maul","description":"Add :boost::boost: to Brawl checks against prone or immobilized targets.","type":"abilities"},{"name":"Creature of the Aenlong","description":"Reduce the difficulty of Arcana checks by one, to a minimum of :easy:, and increases the base damage of Attack spells by three.","type":"abilities"},{"name":"Amorphous","description":"As an incidental, may increase or decrease its silhouette by 1","type":"abilities"},{"name":"Inconspicuous","description":"When in it's natural element or habitat, this creature appears indistinguishable from the environment; a character can make a :hard: Perception or Vigilance check to identify it","type":"abilities"},{"name":"Spells (Arcana)","description":"This character can choose any magic action allowed for the Arcana skill, and may select additional spell effects as normal. The spells they use most often are the following:","type":"abilities"},{"name":"Spells (Divine)","description":"This character can choose any magic action allowed for the Divine skill, and may select additional spell effects as normal. The spells they use most often are the following:","type":"abilities"},{"name":"Spells (Primal)","description":"This character can choose any magic action allowed for the Primal skill, and may select additional spell effects as normal. The spells they use most often are the following:","type":"abilities"},{"name":"Spells (Verse)","description":"This character can choose any magic action allowed for the Verse skill, and may select additional spell effects as normal. The spells they use most often are the following:","type":"abilities"},{"name":"Spells (Runes)","description":"This character can choose any magic action allowed for the Runes skill, and may select additional spell effects as normal. The spells they use most often are the following:","type":"abilities"},{"name":"Dark Sight","description":"Can see in the absence of light without penalty.","type":"abilities"},{"name":"Demon","description":"This adversary is affected by abilities affecting demons.","type":"abilities"},{"name":"Regeneration","description":"At the beginning of its turn, this creature automatically heals 3 wounds.","type":"abilities"},{"name":"Archon","description":"See SotC page 260","type":"abilities"},{"name":"Arboreal","description":"Treats foliage as clear terrain","type":"abilities"},{"name":"Critical Numbers","description":"Adds :advantage: to combat checks if there are two or more members in the minion group.","type":"abilities"},{"name":"Adversary","description":"Upgrade the difficulty of any combat check targeting this character {ranks|times}.","ranked":true,"type":"talents"},{"name":"Aggressive Negotiations","description":"Once per session as an action, may make a :hard: Lightsaber check to decrease the difficulty of all Negotiation checks the character makes for the remainder of the encounter by two to a minimum of zero.","type":"talents"},{"name":"All-Terrain Driver","description":"Does not suffer usual penalties for driving through difficult terrain when using Piloting: Planetary.","type":"talents"},{"name":"Anatomy Lessons","description":"Spend one Destiny Point to add damage equal to Intellect to one hit of an attack with a non-starship/vehicle weapon","type":"talents"},{"name":"Animal Empathy","description":"When attempting to handle or tame animals, add :force: no greater than Force rating to the check and spend :forcepip: to add :success: or :advantage:.","type":"talents"},{"name":"Armour Master","description":"When wearing armour, the character increases their total Soak value by 1.","type":"talents"},{"name":"Armour Master (Improved)","description":"When wearing armour with a Soak value of 2 or higher, the character increases their Defence by 1.","type":"talents"},{"name":"Ataru Technique","description":"May use Agility instead of Brawn when making Lightsaber skill checks.","type":"talents"},{"name":"Bacta Specialist","description":"Patients heal {ranks} additional Wounds when they heal wounds from bacta tanks or long-term care.","ranked":true,"type":"talents"},{"name":"Bad Cop","description":"May spend :advantage::advantage: from a Deception or Coercion check to upgrade the ability of an ally's social skill check against the same target in the same encounter.","ranked":true,"type":"talents"},{"name":"Bad Motivator","description":"Once per session as an action, make a :hard: mechanics check to cause one targeted device to spontaneously fail.","type":"talents"},{"name":"Bad Press","description":"Once per session as an action, may make a :hard: Deception check to reduce the Wound Thresholds of an organisations members by 1, plus 1 per :success::success::success: (to a minimum of 1), until the end of the session.","type":"talents"},{"name":"Balance","description":"When the character rolls to recover Strain at the end of an encounter, they may roll {Force Rating} and recover Strain equal to :forcepip: generated.","type":"talents"},{"name":"Barrage","description":"Add {ranks} damage to all Gunnery and Ranged attacks at Medium or Long range.","ranked":true,"type":"talents"},{"name":"Basic Combat Training","description":"Brawl and Ranged: Light become career skills.","type":"talents"},{"name":"Black Market Contacts","description":"Decrease rarity of sought item by {ranks|words} when looking on the black market; item’s cost is increased by 50%.","ranked":true,"type":"talents"},{"name":"Blackmail","description":"When an NPC exceeds their Strain Threshold by any means other than a combat check, may spend one Destiny point to compel the NPC to perform one simple task before becoming Incapacitated.","type":"talents"},{"name":"Blooded","description":"Add {ranks|boost} to all checks to resist or recover from venoms, poisons, and toxins; reduce duration of ongoing effects from poisons, venoms, and toxins by two rounds, to a minimum of one.","ranked":true,"type":"talents"},{"name":"Body Guard","description":"Once per round, may suffer up to {ranks} Strain to take the Body Guard maneuver to protect an engaged ally; until the end of the character’s next turn, upgrade the difficulty of all combat checks targeting the protected ally once per Strain spent.","ranked":true,"type":"talents"},{"name":"Body Guard (Improved)","description":"Once per session, when an ally protected by the character’s Body Guard maneuver would suffer a hit from a combat check, the character may choose to suffer the hit instead.","type":"talents"},{"name":"Bought Info","description":"Instead of making a Knowledge check, may take a Bought Info action to spend credits equal to 50 times the difficulty of the check to pass with one :success:.","type":"talents"},{"name":"Brace","description":"As a maneuver, remove up to {ranks|setback} added due to environmental conditions from next skill check.","ranked":true,"type":"talents"},{"name":"Brilliant Evasion","description":"Once per encounter when piloting a vehicle or starship, as an action may select one opponent and make an opposed Piloting: Planetary or Space check; if successful the opponent’s vehicle of starship cannot attack the character’s vehicle for {Agility} rounds.","type":"talents"},{"name":"Burly","description":"Reduce any wielded or carried wepaon's Cumnbersome quality and Encumbrance rating by {ranks} to a minimum of 1.","ranked":true,"type":"talents"},{"name":"Bypass Security","description":"Remove {ranks|setback} from any Computers or Skulduggery check to bypass security.","ranked":true,"type":"talents"},{"name":"Calming Aura","description":"When an opponent targets the character with a Force power, after the opponent generates :forcepip:, reduce the total number of :forcepip: generated by one, to a minimum of 0.","type":"talents"},{"name":"Calming Aura (Improved)","description":"The character may spend a maneuver and suffer 2 Strain to extend the effects of Calming Aura to {ranks|Willpower} allies within Short range. This lasts until the beginning of the character’s next turn.","type":"talents"},{"name":"Careful Planning","description":"Once per session, may introduce a “fact” into the narrative as if a Destiny Point had been spent.","type":"talents"},{"name":"Centre of Being","description":"Once per round, when wielding a lightsaber, may make a Centre of Being maneuver. Until the beginning of the character’s next turn, whenever an enemy makes a melee attack targeting the character, the critical rating of the enemy’s weapon counts as {ranks|words} higher.","ranked":true,"type":"talents"},{"name":"Centre of Being (Improved)","description":"Once per round, when wielding a lightsaber, may make a Centre of Being incidental. Until the beginning of the character’s next turn, whenever an enemy makes a melee attack targeting the character, the critical rating of the enemy’s weapon counts as {ranks|words} higher.","type":"talents"},{"name":"Circle of Shelter","description":"When an Engaged ally suffers a hit, may use Parry or Reflect incidental against the hit.","type":"talents"},{"name":"Clever Commander","description":"When upgrading the ability of a mass combat check, may use Knowledge: Warfare in place of Leadership.","type":"talents"},{"name":"Clever Solution","description":"Once per session, make one skill check using Cun­ning rather than the characteristic linked to that skill.","type":"talents"},{"name":"Codebreaker","description":"Remove {ranks|setback} from checks made to break codes or decrypt communications; decrease difficulty of checks made to break codes or decrypt commu­nications by 1.","ranked":true,"type":"talents"},{"name":"Command","description":"Add {ranks|boost} to Leadership checks; affected targets add {ranks|boost} to Discipline checks for the next 24 hours.","ranked":true,"type":"talents"},{"name":"Commanding Presence","description":"Remove {ranks|setback} from all Leadership checks.","ranked":true,"type":"talents"},{"name":"Comprehend Technology","description":"Once per session, the character may take the Comprehend Technology Action, making an :average: Knowledge: Education skill check to intuitively understand one piece of equipment. For the remained of the encounter, when making any skill checks to use or repair the item the character may use their Force Rating in place of the skill.","type":"talents"},{"name":"Conditioned","description":"Remove {ranks|setback} from Athletics and Coordination checks. Reduce Strain suffered from falling by {Coordination}.","ranked":true,"type":"talents"},{"name":"Confidence","description":"Decrease difficulty of Discipline checks to avoid fear {ranks|times}.","ranked":true,"type":"talents"},{"name":"Congenial","description":"May suffer up to {ranks} Strain to downgrade the difficulty of Charm or Negotiation checks by one per Strain spent or upgrade difficulty once per Strain spent when targeted by Charm or Negotiation checks.","ranked":true,"type":"talents"},{"name":"Contingency Plan","description":"May spend one Destiny point to recover {Cunning} Strain.","type":"talents"},{"name":"Contraption","description":"Once per session, as an action, may make a :hard: Mechanics check to fashion a device to solve a current problem using just the tools and parts on hand.","type":"talents"},{"name":"Convincing Demeanor","description":"Remove {ranks|setback} from any Deception or Skulduggery check.","ranked":true,"type":"talents"},{"name":"Coordinated Assault","description":"As a maneuver, may grant {Leadership} allies in Engaged range :advantage: to all combat checks until the beginning of next turn; increase range by one range band per rank beyond the first.","ranked":true,"type":"talents"},{"name":"Coordination Dodge","description":"When targeted by a combat check, as an incidental, may spend one Destiny point to add {ranks|failure}.","type":"talents"},{"name":"Counterstrike","description":"Whenever an attack misses the character, they may spend :threat::threat: or :despair: to upgrade the next Lightsaber (Cunning) combat check they make against the attacker during their next turn once.","type":"talents"},{"name":"Creative Killer","description":"Reduce the critical rating of all improvised weapons the character is wielding by 2 to a minimum of 1.","type":"talents"},{"name":"Crippling Blow","description":"May increase difficulty of attack by 1. If successful, target suffers 1 Strain when moving for remainder of encounter.","type":"talents"},{"name":"Crucial Point","description":"Once per session during ongoing negotiations, as an incidental, may introduce one concession that an opponent will do anything to obtain.","ranked":true,"type":"talents"},{"name":"Cutting Question","description":"Once per encounter, may make one Coercion check using the Deception skill.","type":"talents"},{"name":"Dead to Rights","description":"Spend 1 dark side Destiny Point to add additional damage equal to half Agility to one hit of a successful attack made with ship or vehicle-mounted weaponry.","type":"talents"},{"name":"Dead to Rights (Improved)","description":"The character may spend one Destiny point to add {Agility} to one hit of a successful attack made by ship or vehicle-mounted weaponry. This replaces the normal Dead to Rights ability.","type":"talents"},{"name":"Deadly Accuracy (Brawl)","description":"Add {Brawl} to all damage from attacks using Brawl.","ranked":true,"type":"talents"},{"name":"Deadly Accuracy (Melee)","description":"Add {Melee} to all damage from attacks using Melee.","ranked":true,"type":"talents"},{"name":"Deadly Accuracy (Ranged: Light)","description":"Add {Ranged: Light} to all damage from attacks using Ranged: Light.","ranked":true,"type":"talents"},{"name":"Deadly Accuracy (Ranged: Heavy)","description":"Add {Ranged: Heavy} to all damage from attacks using Ranged: Heavy.","ranked":true,"type":"talents"},{"name":"Death From Above","description":"Once per encounter while using a jetpack, may take the Death From Above action, inflicting 1 system strain on their jetpack and making a :hard: Piloting (Planetary) check. If the check is successful, for each :success:, one adversary of silhouette 0 or 1 within Short range is knocked prone. May spend :triumph: to stagger one affected target until the end of that adversary's next turn.","type":"talents"},{"name":"Debilitating Shot","description":"When making a successful attack with a ship or vehicle-mounted weapon, may spend :advantage::advantage: to reduce the maximum speed of the target by 1, to a minimum of 1, until the end of the next round.","type":"talents"},{"name":"Defensive Circle","description":"While wielding a lightsaber, the character may take the Defensive Circle action and make a :hard: Lightsaber (Intellect) skill check. If successful the character plus one ally per :success: within Short range gains ranged and melee defence equal to 1 plus 1 per :advantage::advantage: until the beginning of the character’s next turn.","type":"talents"},{"name":"Defensive Driving","description":"Increase Defence of vehicle or starship being piloted {ranks|times}.","ranked":true,"type":"talents"},{"name":"Defensive Slicing","description":"When defending computer systems, add {ranks|setback} to opponents’ checks.","ranked":true,"type":"talents"},{"name":"Defensive Slicing (Improved)","description":"When defending computer systems, upgrade the difficulty of an opponent’s dice pool {ranks|words}.","ranked":true,"type":"talents"},{"name":"Defensive Stance","description":"Once per round on the character’s turn as a maneuver, they may suffer up to {ranks} Strain to upgrade the difficulty of all melee combat checks targeting them once per Strain spent. This lasts until the start of the character’s next turn. ","ranked":true,"type":"talents"},{"name":"Defensive Training","description":"When the character wields a Lightsaber, Melee, or Brawl weapon, that weapons gains Defensive {ranks}.","ranked":true,"type":"talents"},{"name":"Discredit","description":"Once per encounter as an action, make a :hard: Deception check to make one character upgrade the difficulty of social checks once, and one additional time for every :advantage::advantage:.","type":"talents"},{"name":"Disorient","description":"After hitting with a combat check, may spend :advantage::advantage: to disorient target for {ranks|words} rounds.","ranked":true,"type":"talents"},{"name":"Disruptive Strike","description":"The character may take a Disruptive Strike action, making a Lightsaber (Cunning) skill check against one Engaged target and add {Force Rating}. Spend :forcepip: to add :failure: to the target’s next combat check.","type":"talents"},{"name":"Distracting Behaviour","description":"As a maneuver, may suffer up to {Cunning} Strain to make an equal number of adversaries at Engaged range suffer :threat: on their next skill check. Ranks increase range band.","ranked":true,"type":"talents"},{"name":"Distracting Behaviour (Improved)","description":"As a maneuver, may suffer up to {Cunning} Strain to make an equal number of adversaries at Engaged range suffer :threat::threat: on their next skill check. Ranks increase range band.","ranked":true,"type":"talents"},{"name":"Djem So Deflection","description":"Once per round, after using the Reflect incidental, the character may spend one Destiny point to perform Move manevuer as an out of turn incidental to move closer to or engage an opponent.","type":"talents"},{"name":"Dodge","description":"Once per round, when targeted by a combat check, suffer up to {ranks} Strain to upgrade the difficulty once per Strain spent.","ranked":true,"type":"talents"},{"name":"Double-Talk","description":"May spend :advantage::advantage: or :triumph: from a successful Charm or Deception check to Disorient {Presence} opponents within Short range for the remainder of the current round and the next two rounds.","type":"talents"},{"name":"Draw Closer","description":"Perform Draw Closer action; make a Lightsaber (Willpow­er) combat check against one Silhouette 1 target within Medium range, adding :force: no greater than Force rating to check. Spend :forcepip: to move target one range band closer or to add :success: to check.","type":"talents"},{"name":"Drive Back","description":"Spend :triumph: or :advantage::advantage::advantage: on a missed Brawl, Lightsaber, or Melee combat check to force the target to make a move maneuver in a direc­tion of the character’s choice.","type":"talents"},{"name":"Duelist’s Training","description":"Add :boost: to Melee and Lightsaber skill checks when engaged with a single opponent.","type":"talents"},{"name":"Durable","description":"Subtract {ranks|multiply-10} from Critical Injury rolls made against the character, to a minimum of 01.","ranked":true,"type":"talents"},{"name":"Dynamic Fire","description":"When making a ranged attack while engaged with an opponent, the character may suffer 2 Strain to reduce the ranged modifier for being engaged by 1 for the attack.","type":"talents"},{"name":"Empty Soul","description":"If carrying items that total 2 Encumbrance or less, may add :lightside::darkside: to any Force power check.","type":"talents"},{"name":"Encoded Communique","description":"Upgrade the difficulty of checks to decrypt this character’s coded messages without the proper cipher {Computers} times.","type":"talents"},{"name":"Encouraging Words","description":"When an ally at Engaged range fails a check, may suffer 1 Strain to assist the next check that ally makes in this encounter as an out of turn incidental.","type":"talents"},{"name":"Enduring","description":"Increase Soak by {ranks} (already included in profile).","ranked":true,"type":"talents"},{"name":"Enhanced Leader","description":"Add :force: equal to Force rating to Leadership checks; spend :forcepip: to add :success: or :advantage: to the result.","type":"talents"},{"name":"Exhaust Port","description":"Before attacking a starship or vehicle, the character may spend one Destiny point to ignore the effects of the Massive rule for the attack.","type":"talents"},{"name":"Expert Handler","description":"Remove {ranks|setback} from Survival checks to ride beasts.","ranked":true,"type":"talents"},{"name":"Expert Tracker","description":"Remove {ranks|setback} from checks to find tracks or track targets; decrease time to track a target by 50%.","ranked":true,"type":"talents"},{"name":"Eye for Detail","description":"When making a Mechanics or Computers check, may suffer up to {ranks} Strain to convert an equal number of :success: into :advantage:.","ranked":true,"type":"talents"},{"name":"Falling Avalanche","description":"Once per round, suffer 2 Strain to add {Brawn} to damage of one successful Lightsaber combat check.","type":"talents"},{"name":"Familiar Suns","description":"Once per session, may spend a maneuver to make a :hard: Knowledge: Outer Rim or Knowledge: Core Worlds check to know information about the current planet.","type":"talents"},{"name":"Fearsome","description":"May force Engaged opponents to make a fear check with the difficulty equal to ranks in Fearsome.","ranked":true,"type":"talents"},{"name":"Fear is My Ally","description":"Spend :threat: on an opposed social skill check against Maul for him to recover 1 Strain.","type":"talents"},{"name":"Feint","description":"Upon missing an opponent with a Lightsaber, Brawl, or Melee combat check, may spend :triumph: or :advantage::advantage::advantage: to upgrade the difficulty of the opponent’s next combat check targeting this character {ranks|times}.","ranked":true,"type":"talents"},{"name":"Feral Strength","description":"+{ranks} damage on all Brawl and Melee attacks.","ranked":true,"type":"talents"},{"name":"Field Commander","description":"As an action, may make an :average: Leadership check; up to {Presence} allies may immediately suffer 1 Strain to perform a free maneuver.","type":"talents"},{"name":"Field Commander (Improved)","description":"As an action, may make an :average: Leadership check; up to {Presence} allies may immediately suffer 1 Strain to perform a free maneuver; spend :triumph: to allow one ally to perform an action instead.","type":"talents"},{"name":"Fine Tuning","description":"Repair an additional {ranks} System Strain when repairing ships or vehicles.","ranked":true,"type":"talents"},{"name":"Finesse","description":"May use Agility instead of Brawn for Brawl and Melee checks.","type":"talents"},{"name":"Fire Control","description":"Take the Fire Control action; all combat checks made from current starship or vehicle count their target’s Silhouette as one higher than nor­mal until the beginning of next turn.","ranked":true,"type":"talents"},{"name":"Forager","description":"Remove up to :setback::setback: from skill checks to find food, water, or shelter; finding these items requires half the usual time.","type":"talents"},{"name":"Force Assault","description":"Upon missing an opponent with a Lightsaber (Willpower) combat check, may spend :triumph: or :advantage::advantage::advantage: to perform a Move Force power action as a maneuver this turn.","type":"talents"},{"name":"Force of Will","description":"Once per session, may make one skill check using Willpower rather than the characteristic linked to the skill.","type":"talents"},{"name":"Force Protection","description":"As a maneuver, May suffer 1 Strain and commit a number of :force: no greater than Force Rating or ranks of Force Protection. Increase Soak by :force: committed. Spend 1 Strain at the beginning of each turn in which :force: remain committed.","ranked":true,"type":"talents"},{"name":"Force Rating","description":"Roll {ranks|force} to activate Force powers.","ranked":true,"type":"talents"},{"name":"Forewarning","description":"As an action, may allow all allies within Medium range to increase their melee and ranged defence by {Force Rating} until they take their first turn during an encounter.","type":"talents"},{"name":"Formation Tactics","description":"As an action, may make a :hard: Leadership to choose a number of allies within Short range equal to :success:. The difficulty of the attacks against the chosen allies are upgraded once until the end of the character’s next round.","type":"talents"},{"name":"Formation Tactics (Improved)","description":"As an action, may make an :average: Leadership to choose a number of allies within Short range equal to :success:. The difficulty of the attacks against the chosen allies are upgraded once until the end of the character’s next round. Spend :triumph: or :advantage::advantage::advantage::advantage::advantage::advantage: to have the effect last until the end of the encounter.","type":"talents"},{"name":"Form on Me","description":"{Leadership} allies in Close range gain the benefits of the Gain the Advantage action.","type":"talents"},{"name":"Frenzied Attack","description":"When making a Melee or Brawl check, suffer up to {ranks} Strain to upgrade the attack an equal number of times.","ranked":true,"type":"talents"},{"name":"Full Stop","description":"When piloting a ship or vehicle, may take the Full Stop maneuever to immediately reduce the speed of the ship or vehicle to zero. The ship or vehicle suffers 1 System Strain for every point of speed it had before stopping.","type":"talents"},{"name":"Full Throttle","description":"Take a Full Throttle action and make a :hard: Piloting (Space or Planetary) check to increase a vehicle’s top speed by 1 for {Cunning} rounds.","type":"talents"},{"name":"Full Throttle (Improved)","description":"Suffer 1 Strain to make an :average: Piloting: Planetary check as maneuver and in­crease top speed by 1 for {Cunning} rounds.","type":"talents"},{"name":"Full Throttle (Supreme)","description":"As an action, make a :hard: piloting check to increase the vehicle’s top speed by two for three rounds; suffer 1 Strain to use as maneuver and reduce difficulty to :average:.","type":"talents"},{"name":"Galaxy Mapper","description":"Remove {ranks|setback} from all Astrogation checks; Astrogation checks take 25% less time per rank.","ranked":true,"type":"talents"},{"name":"Gang Leader","description":"May spend a maneuver giving orders to other posse mem­bers within Medium range, granting them :boost: on their next check.","type":"talents"},{"name":"Gearhead","description":"Remove {ranks|setback} from Mechanics checks.","ranked":true,"type":"talents"},{"name":"Good Cop","description":"The character may spend :advantage::advantage: from a Charm or Negotiation check to upgrade the ability of a single ally’s subsequent social interaction check against the same target {ranks|times}.","ranked":true,"type":"talents"},{"name":"Go Without","description":"Once per session as an incidental, the character counts as having the right tools for the job when performing a skill check this turn.","type":"talents"},{"name":"Grapple","description":"Once per round, may perform the Grapple ma­neuver. Until the beginning of the character’s next turn, en­emies must spend two maneuvers instead of one to move from Engaged range to Short range of the character.","type":"talents"},{"name":"Greased Palms","description":"Before making a social check, may spend up to {ranks|multiply-50} credits to upgrade the ability of the check once per 50 credits spent.","type":"talents"},{"name":"Guns Blazing","description":"When making a combined cmobat check with two Ranged: Light weapons, may suffer 2 Strain to ignore the difficulty penalty from attacking with two weapons.","type":"talents"},{"name":"Hard Headed","description":"On any turn when Staggered or Disoriented, may perform the Hard Headed action to make a :daunting: Discipline skill check. If successful the character is no longer Staggered or Disoriented. The difficulty of this check decreases by one per rank, to a minimum of :easy:.","ranked":true,"type":"talents"},{"name":"Hard Headed (Improved)","ranked":true,"description":"May use the Hard Headed action to recover from being Incapacitated due to exceeding Strain Threshold. On the turn after being Incapacitated the character may make a :formidable: Discipline check, if successful their Strain decreases to one below their Strain Threshold. The difficulty of this check decreases by one per rank, to a minimum of :easy:.","type":"talents"},{"name":"Hawk Bat Swoop","description":"May perform a Light­saber (Agility) melee combat check against one target within Short range and add :force: no greater than Force Rating to the pool. The character may spend :forcepip: before resolving the success or failure of the check to engage the target immediately as an inci­dental, and may spend :forcepip: to add :advantage: to the check. If the character cannot move to engage the target, the attack automatically misses.","type":"talents"},{"name":"Healing Trance","description":"The character may commit :force:. For every full encounter :force: remains committed, the character heals {ranks} additional Wound(s) they are suffering.","ranked":true,"type":"talents"},{"name":"Healing Trance (Improved)","description":"Whenever the character heals Wounds as a result of Healing Trance, if they are suffering from a Critical Injury, they may make a Resilience check with the difficulty equal to the Critical Injury’s severity rating. If successful, they recover from the Critical Injury.","type":"talents"},{"name":"Heavy Hitter","description":"Once per session, may spend :triumph: on a successful Ranged: Heavy or Gunnery check to add the Breach 1 quality to the attack or increase an existing Breach rating by 1.","type":"talents"},{"name":"Heightened Awareness","description":"Allies within Short range add :boost: to Perception and Vigilance checks; allies in Engaged range add :boost::boost: instead.","type":"talents"},{"name":"Heroic Fortitude","description":"Spend one Destiny point to ignore effects of Critical Injuries on Brawn or Agility checks until the end of the encounter.","type":"talents"},{"name":"Heroic Resilience","description":"Immediately after being hit by a successful combat check but before damage is calculated, may spend one Destiny point to increase Soak by {Resilience}.","type":"talents"},{"name":"Hidden Storage","description":"An large equipment, vehicle, or droid the character owns has one or more hidden compartments with an encumbrance total of {ranks}.","ranked":true,"type":"talents"},{"name":"Hit And Run","description":"While the character is using a jetpack, after they complete an attack targeting an opponent they are engaged with, they may immediately disengage as an incidental.","type":"talents"},{"name":"Hold Together","description":"Flip one Destiny Point to make a Hold Together incidental immediately after a starship takes damage to convert the suffered Hull Trauma to System Strain.","type":"talents"},{"name":"Hunter","description":"Add {ranks|boost} to all skill checks when interacting with wild beasts and animals, including combat checks. Add {ranks|multiply-10} to all Criti­cal Injury rolls against animals.","ranked":true,"type":"talents"},{"name":"Hunter’s Quarry","description":"As an action make a :hard: Survival check to upgrade the ability of all attacks against one target at Long range until the end of the big game hunter’s next turn.","type":"talents"},{"name":"Hunter’s Quarry (Improved)","description":"may take the Hunter’s Quarry action against an opponent within long range, making a :hard: Survival check. If the check succeeds, upgrade the ability of all attacks made against the target by one until the end of the character’s next turn. The character can choose to suffer 2 strain to perform the Hunter’s Quarry action as a maneuver instead","type":"talents"},{"name":"Idealist","description":"Spend 1 Strain to add an :advantage: on a skill check.","ranked":true,"type":"talents"},{"name":"Imbue Item","description":"Spend a maneuver to com­mit :force: and grant one weapon at Short range +1 dam­age or decrease critical rating of weapon by one.","type":"talents"},{"name":"Improved Dodge","description":"When the character performs the Dodge incidental, the character may make a Move maneuver as an out-of-turn incidental after the triggering attack has been resolved.","type":"talents"},{"name":"Improvised Detonation","description":"Once per session as an action, may make a :hard: Mechanics check to build an explosive device out of available materials. The device's damage is equal to Intellect, plus Mechanics, plus :success: and possesses the Blast quality at an equal value. Spend :triumph: to increase the damage by 2. :despair: causes the device to detonate immediately.","type":"talents"},{"name":"Improvised Detonation (Improved)","description":"Once per session as an action, may make a :average: Mechanics check to build an explosive device out of available materials. The device's damage is equal to Intellect, plus Mechanics times two, plus :success: and possesses the Blast quality at an equal value. Spend :triumph: to increase the damage by 2. :despair: causes the device to detonate immediately.","type":"talents"},{"name":"In the Know","description":"Remove {ranks|setback} to get information from people or disseminate it to others.","ranked":true,"type":"talents"},{"name":"In the Know (Improved)","description":"Once per session as an action, may make an opposed Deception vs Vigilance check against an NPC with the difficulty downgraded {ranks|times}. The NPC believes false information created by the character.","ranked":true,"type":"talents"},{"name":"Incite Rebellion","description":"Once per session as an Action, make a :hard: Coercion check to cause up to {Coercion} beings to become rebellious until the end of the encounter.","type":"talents"},{"name":"Indistinguishable","description":"Opposing characters upgrade the difficulty of any checks made to identify the character {ranks|times}.","ranked":true,"type":"talents"},{"name":"Informant","description":"Once per session, may reveal a contact who possesses information on a subject of the character's choice.","type":"talents"},{"name":"Insight","description":"Perception and Discipline are career skills.","type":"talents"},{"name":"Inspiring Leadership","description":"As an action, may make an :average: Leadership check to grant up to {Presence} allies within Short range an automatic :success: on their next skill check.","type":"talents"},{"name":"Inspiring Rhetoric","description":"As an action, may make an :average: Leadership check; each :success: removes one Strain or Wound from one ally in Short range; spend :advantage: to remove an additional Strain or Wound from an affected ally.","type":"talents"},{"name":"Inspiring Rhetoric (Improved)","description":"As an action, may make an :average: Leadership check; each :success: removes one Strain or Wound from one ally in Short range; spend :advantage: to remove an additional Strain or Wound from an affected ally; all affected allies add :boost: to all checks for two rounds.","type":"talents"},{"name":"Inspiring Rhetoric (Supreme)","description":"As a maneuver, may make an :average: Leadership check; each :success: removes one Strain or Wound from one ally in Short range; spend :advantage: to remove an additional Strain or Wound from an affected ally; all affected allies add :boost: to all checks for four rounds.","type":"talents"},{"name":"Intense Focus","description":"Suffer 1 Strain to upgrade any skill check once.","type":"talents"},{"name":"Intense Presence","description":"Spend 1 dark side Destiny point to recover {Presence} Strain.","type":"talents"},{"name":"Interjection","description":"After another character makes a social check, may suffer 3 Strain make an :average: Vigilance check. The character may add :success: or :failure: to the results of the chosen check equal to :successL on the Vigilance check and :advantage: or :threat: equal to :threat: on the Vigilance check.","type":"talents"},{"name":"Intimidating","description":"May suffer up to {ranks} Strain to downgrade the difficulty of a Coercion check a number of times equal to the Strain suffered; when targeted by Coercion, they may suffer up to {ranks} Strain to upgrade the difficulty of the opponent’s check a number of times equal to the Strain suffered.","ranked":true,"type":"talents"},{"name":"Intuitive Evasion","description":"As a ma­neuver, suffer 1 Strain and commit :force: to upgrade the difficulty of all combat checks targeting pilot’s vehicle once, until the beginning of pilot’s next turn.","ranked":true,"type":"talents"},{"name":"Intuitive Improvements","description":"When mak­ing a check to repair or craft an item, may add :force: up to Force Rating to the check. Spend :forcepip::forcepip: to permanently increase the item’s hard points by 1.","type":"talents"},{"name":"Intuitive Navigation","description":"Add :advantage: to all Astrogation checks.","type":"talents"},{"name":"Intuitive Shot","description":"When making a Ranged: Heavy, or Ranged: Light combat check, may add {Force Rating} to the check. May spend :forcepip: to add :success: or :advantage: to the result.","type":"talents"},{"name":"Intuitive Strike","description":"When making a combat check with a vehicle weapon, may add {Force Rating} to the check. Spend :forcepip::forcepip: to add :success: or :advantage: to the result.","type":"talents"},{"name":"Inventor","description":"When constructing new items or modifying items or attachments, may choose to add {ranks|boost} to the check.","ranked":true,"type":"talents"},{"name":"Invigorate","description":"Once per encounter, when an ally within Short range attempts a skill check using Brawn or Agility, may roll :force:. Each :lightside: adds :success: to the target’s check; while each :darkside: adds :threat:.","type":"talents"},{"name":"Iron Soul","description":"If carrying items that total 2 Encumbrance or less, may heal all Strain at the end of an encounter.","type":"talents"},{"name":"It’s Not That Bad","description":"Once per session, when an ally is about to suffer a Critical Injury, may take an It’s Not That Bad incidental to make a :hard: Medicine check. If successful, the ally does not gain the Critical Injury.","type":"talents"},{"name":"Jetpack Expertise","description":"The character may spend :advantage: from checks they make to remove 1 system strain from a jetpack they are equipped with. (They may choose this effect multiple times when spending :advantage:).","type":"talents"},{"name":"Jump Up","description":"Once per round, may stand from seated or prone as an incidental.","type":"talents"},{"name":"Jury Rigged","description":"The character chooses one personal weapon or piece of armour per rank. May increase the damage of a weapon by one; decrease the critical rating by 1; or increase the range and melee defence of armour 1.","ranked":true,"type":"talents"},{"name":"Just Kidding!","description":"Once per round as an incidental, when the character or any of his allies in short range generages a :despair: on a social skill check, the character may spend one Destiny Point to convert a single :despair: generated on the check to :failure:. When he does this, he must explain what he says or does to smooth things over after the verbal misstep","type":"talents"},{"name":"Just Kidding! (Improved)","description":"Once per round, spend one Destiny Point to convert a single :despair: on one social check to :advantage:, but must explain how the verbal misstep became advantageous.","type":"talents"},{"name":"Keen Eyed","description":"Remove {ranks|setback} from Perception and Vigilance checks; checks made to search a specific time take 50% less time than usual.","ranked":true,"type":"talents"},{"name":"Kill with Kindness","description":"Remove {ranks|setback} from all Charm and Leadership checks.","ranked":true,"type":"talents"},{"name":"Knockdown","description":"May spend :triumph: to knock target prone with successful melee attack.","type":"talents"},{"name":"Know Somebody","description":"Once per session, when attempting to purchase a legally available item, reduce its rarity by {ranks|words}.","ranked":true,"type":"talents"},{"name":"Know the Enemy","description":"May use Knowledge: Warfare when making checks for initiative.","type":"talents"},{"name":"Know their Weakness","description":"Once per session, the character may choose one target within Short range and perform the Know Their Weakness action to make a :hard: Perception check. If successful, the character downgrades the difficulty of all social skill checks they make against the target once per rank of Know Their Weakness.","type":"talents"},{"name":"Knowledge is Power","description":"Once per session, when making a single check, may treat Force Rating as {Knowledge: Lore}.","type":"talents"},{"name":"Knowledge Specialization","description":"When acquired, choose 1 Knowledge skill. When making that skill check, may spend :triumph: result to gain {ranks|success}.","ranked":true,"type":"talents"},{"name":"Knowledge Specialization: Lore","description":"When making skill checks with Knowledge: Lore, may spend :triumph: result to gain {ranks|success}.","ranked":true,"type":"talents"},{"name":"Knowledgeable Healing","description":"When the character performs a successful Medicine check, may spend one Destiny point heal {Knowledge: Xenology} additional Wounds.","type":"talents"},{"name":"Known Schematic","description":"Once per session, may perform the Known Schematic maneuver; make a :hard: Knowledge (Education) check; success grants familiarity with a building or ship’s design.","type":"talents"},{"name":"Lead from the Back","description":"Once per round when an enemy makes a successful combat check targeting the character, the character may spend one Destiny point to perform the Lead from the Back incidental. The character chooses one allied NPC subordinate within Short range, who becomes the target of the attack instead. At the GM's discretion, the character may select an allied NPC at a greater distance if they are between the character and the attacker.","type":"talents"},{"name":"Let’s Ride","description":"May mount or dismount from a creature as an incidental.","type":"talents"},{"name":"Lethal Blows","description":"Add {ranks|multiply-10} to Critical In­jury rolls against opponents.","ranked":true,"type":"talents"},{"name":"Loom","description":"When an Engaged ally makes a successful Charm, Deception, or Negotia­tion check, add :advantage: per rank in Coercion to the check.","type":"talents"},{"name":"Makashi Flourish","description":"Once per encounter, as an action action, make an :average: Lightsaber (Presence) check. If successful, one Engaged opponent suffers Strain equal to :success: and the character recovers an equal amount of Strain. May also spend :triumph: or :advantage::advantage::advantage: to Stagger the opponent until the end of their next turn.","type":"talents"},{"name":"Makashi Technique","description":"May use Presence instead of Brawn when making Lightsaber skill checks.","type":"talents"},{"name":"Martial Grace","description":"Once per round, may suffer 2 Strain to add {Coordination} damage to one hit of a successful Brawl combat check.","type":"talents"},{"name":"Master Artisan","description":"Once per round, suffer 2 Strain to decrease the difficulty of a Mechanics check by 1.","type":"talents"},{"name":"Master Doctor","description":"Once per round, suffer 2 Strain to decrease the difficulty of a Medicine check by 1.","type":"talents"},{"name":"Master Driver","description":"Once per round when piloting a vehicle using the Piloting: Planetary skill, suffer 2 Strain to perform any action as a maneuver instead.","type":"talents"},{"name":"Master Grenadier","description":"Decrease the :advantage: cost to activate the Blast quality of any weapon used by 1 to a minimum of 1.","type":"talents"},{"name":"Master Instructor","description":"Once per round as an out of turn incidental, may suffer 2 strain to allow ally to use character’s ranks in Discipline for next Discipline check an ally makes.","type":"talents"},{"name":"Master Leader","description":"Once per round, suffer 2 Strain to decrease the difficulty of a Leadership check by 1.","type":"talents"},{"name":"Master Merchant","description":"Before making a check when buying or selling items, suffer 2 Strain to sell items for 25% more or buy for 25% less.","type":"talents"},{"name":"Master of Shadows","description":"Once per round, suffer 2 Strain to decrease the difficulty of a Stealth or Skulduggery check by 1.","type":"talents"},{"name":"Master Pilot","description":"Once per round when piloting a vehicle using the Piloting: Space skill, suffer 2 Strain to perform any action as a maneuver instead.","type":"talents"},{"name":"Master Slicer","description":"Once per round, suffer 2 Strain to decrease the difficulty of a Computers or other slicing-related check by 1.","type":"talents"},{"name":"Experienced Slicer","description":"Add :boost: to Computers and Skulduggery checks made by allies within Short range.","type":"talents"},{"name":"Master Starhopper","description":"Once per round, suffer 2 Strain to decrease the difficulty of a Astrogation check by 1.","type":"talents"},{"name":"Master Strategist","description":"Once per phase during a mass combat, may suffer 2 Strain to decrease the difficulty of a Mass Combat check once.","type":"talents"},{"name":"Meditative Trance","description":"When suffocating, suffers 1 Strain each round instead of 3. When exposed to vacuum, suffers 1 Wound each round instead of 3.","type":"talents"},{"name":"Mental Bond","description":"May commit :force: to communicate mentally with a bonded animal.","type":"talents"},{"name":"Mental Fortress","description":"Spend one Destiny point to ignore effects of Critical Injuries on Intellect or Cunning checks until the end of the encounter.","type":"talents"},{"name":"Mind Bleed","description":"If carrying items that total 2 Encumbrance or less, when targeted by an attack may suffer a number of Strain equal to the number of Wounds suffered from the attack to cause the attacker to suffer the same amount of Wounds.","type":"talents"},{"name":"Mental Tools","description":"Always counts as having the right tools for the jobs when making Mechanics checks.","type":"talents"},{"name":"Mind Over Matter","description":"May spend one Destiny point to recover {Willpower} Strain.","type":"talents"},{"name":"Multiple Opponents","description":"Add :boost: to all Brawl, Melee, and Lightsaber combat checks when engaged with multiple opponents.","type":"talents"},{"name":"Natural Blademaster","description":"Once per session, may reroll any one Lightsaber or Melee check.","type":"talents"},{"name":"Natural Brawler","description":"Once per session, may reroll any one Brawl or Melee check.","type":"talents"},{"name":"Natural Charmer","description":"Once per session, may reroll any one Charm or Deception check.","type":"talents"},{"name":"Natural Commando","description":"Once per session, may re-roll one Ranged (Light) or Stealth check.","type":"talents"},{"name":"Natural Doctor","description":"Once per session, may reroll any one Medicine check.","type":"talents"},{"name":"Natural Driver","description":"Once per session, may reroll any one Piloting: Planetary or Gunnery check.","type":"talents"},{"name":"Natural Enforcer","description":"Once per session, may reroll any one Coercion or Streetwise check.","type":"talents"},{"name":"Natural Hunter","description":"Once per session, may reroll any one Perception or Vigilance check.","type":"talents"},{"name":"Natural Leader","description":"Once per session, may reroll any one Cool or Leadership check.","type":"talents"},{"name":"Natural Marksman","description":"Once per session, may reroll any one Ranged: Light or Ranged: Heavy check.","type":"talents"},{"name":"Natural Mystic","description":"Once per session, the character may reroll any one Force power check.","type":"talents"},{"name":"Natural Negotiator","description":"Once per session, may reroll any one Cool or Negotiation check.","type":"talents"},{"name":"Natural Outdoorsman","description":"Once per session, may reroll any one Resilience or Survival check.","type":"talents"},{"name":"Natural Pilot","description":"Once per session, may reroll any one Piloting: Space or Gunnery check.","type":"talents"},{"name":"Natural Programmer","description":"Once per session, may reroll any one Comput­ers or Astrogation check.","type":"talents"},{"name":"Natural Rogue","description":"Once per session, may reroll any one Skulduggery or Stealth check.","type":"talents"},{"name":"Natural Scholar","description":"Once per session, may reroll any one Knowledge check.","type":"talents"},{"name":"Natural Tinkerer","description":"Once per session, may reroll any one Mechanics check.","type":"talents"},{"name":"Niman Technique","description":"May use Willpower instead of Brawn when making lightsaber checks.","type":"talents"},{"name":"No Escape","description":"When making a Coercion check, may spend :advantage::advantage: to cause one enemy within Short range to lose their free maneuver during their next turn. When an enemy within Short range makes a Fear check, may spend :threat::threat: from that check to cause the enemy to lose their free maneuver during their next turn.","type":"talents"},{"name":"Nobody’s Fool","description":"Upgrade difficulty of Charm, Coercion, and Deception checks targeting the character {ranks|times}.","ranked":true,"type":"talents"},{"name":"Now the Master","description":"Once per session, may choose one character in the encounter and one talent or Force power the target character possesses. For the remainder of the encounter the character counts as having that talent or Force power.","type":"talents"},{"name":"Now You See Me","description":"Once per session, may make a :hard: Deception check to make {Cunning} NPCs within Medium range forget any interactions they had with the character during the last thirty minutes.","type":"talents"},{"name":"Once a Learner","description":"As an action, may suffer 4 Strain to increase the Force rating of one ally within Short range by {Force Rating} until the end of the end of the character's next turn.","type":"talents"},{"name":"One with Nature","description":"May make a :simple: Survival check to recover strain at the end of an encounter","type":"talents"},{"name":"One With the Universe","description":"Once per session, may spend several minutes meditating, then make an :average: Astrogation check to add :lightside: to all Force power checks. If the character succeeds with :threat:, add :darkside: instead.","type":"talents"},{"name":"Outdoorsman","description":"Remove {ranks|setback} from checks to move through terrain or manage environmental effects; reduce overland travel times by 50%.","ranked":true,"type":"talents"},{"name":"Overwhelm Defences","description":"After making an unsuccessful attack with a starship or vehicle weapon, may spend :advantage::advantage: per rank. Reduce the defence rating in the zone targeted by 1 for every :advantage::advantage: spent.","type":"talents"},{"name":"Overwhelm Emotions","description":"When performing a Charm, Coercion, or Deception check, may add {Force Rating}. Spend :lightside: to add :success: to Charm checks; spend :darkside: to add :success: to Coercion or Deception checks. However, every :lightside::lightside: adds :failure: to Coercion or Deception checks while :darkside::darkside: adds :failure: to Charm checks.","ranked":true,"type":"talents"},{"name":"Parry","description":"When this character suffers a hit from a melee combat check, after damage is calculated but before soak is applied (so immediately after Step 3 of Perform a Combat check, page 102), this character may suffer 3 strain to use this talent to reduce the damage of the hit by {ranks|plus-2}. This talent can only be used once per hit, and this character needs to be wielding a Melee weapon.","ranked":true,"type":"talents"},{"name":"Parry (Improved)","description":"When this character suffers a hit from a melee combat check and uses Parry to reduce the damage from that hit, after the attack is resolved, you may spend :despair: or :threat::threat::threat: from the attacker’s check to use this talent. Then, this character automatically hits the attacker once with a Brawl or Melee weapon this character is wielding. The hit deals the weapon's base damage, plus any damage from applicable talents or abilities. This character can't use this talent if the original attack incapacitates them.","type":"talents"},{"name":"Parry (Supreme)","description":"When struck by a melee attack but before applying Soak, suffer 3 Strain to reduce damage by {ranks|plus-2}. When parrying a hit that generated :despair: or :threat::threat::threat:, may hit attacker once with a wielded Brawl, Melee, or Lightsaber weapon dealing base damage, after the original attack is resolved. If the character didn’t make a combat check during their previous turn, suffer 1 Strain instead of 3.","type":"talents"},{"name":"Persistent Targeting","description":"After making a successful combat check against a target, add :boost: to all combat checks against the same target for the remainder of the encounter.","type":"talents"},{"name":"Physical Training","description":"Add {ranks|boost} to Athletics and Resistance checks.","ranked":true,"type":"talents"},{"name":"Physician","description":"When this character makes a Medicine check to help a character heal wounds, the target heals {ranks} additional wounds.","ranked":true,"type":"talents"},{"name":"Pin","description":"As an action upon a successful opposed Athletics check against an Engaged opponent, immobilise that opponent until the end of the attacker’s next turn; may spend :triumph: on check to increase duration one round.","type":"talents"},{"name":"Plausible Deniability","description":"Remove {ranks|setback} from all Coercion and Deception checks.","ranked":true,"type":"talents"},{"name":"Plausible Deniability (Improved)","description":"Remove {ranks|setback} from all Coercion and Deception checks. As an action, may make a :hard: Coercion check to convince {rank|words} uninvolved bystander NPC to leave the scene without asking questions.","ranked":true,"type":"talents"},{"name":"Point Blank","description":"Add {ranks} damage to all Ranged: Heavy and Ranged: Light attacks made at Short or Engaged range.","ranked":true,"type":"talents"},{"name":"Positive Spin","description":"When any character's Duty would increase by one or more, it increases by that amount plus {ranks} instead.","ranked":true,"type":"talents"},{"name":"Powerful Blast","description":"Increase Blast damage dealt by explosives, explosive weapons, and grenades by {ranks}.","ranked":true,"type":"talents"},{"name":"Precise Aim","description":"Once per round, may perform a Precise Aim maneuver to suffer up to {ranks} Strain to reduce target’s melee and ranged defences by Strain spent.","ranked":true,"type":"talents"},{"name":"Precision Strikes","description":"Use Cunning in place of Brawn for Brawl and Melee: Light checks.","type":"talents"},{"name":"Preemptive Avoidance","description":"Immediately after an opponent moves to engage the character, may spend a Destiny point to disengage from that opponent as an out of turn incidental.","type":"talents"},{"name":"Pressure Point","description":"When making a Brawl check against a living opponent, may add {Medicine} to damage and deal damage as Strain instead of Wounds.","type":"talents"},{"name":"Prey on the Weak","description":"Deal +{ranks} damage against Disoriented targets.","ranked":true,"type":"talents"},{"name":"Push the Limit","description":"As an incidental, suffer 2 system to add :boost: to Piloting: Planetary checks.","type":"talents"},{"name":"Quick Draw","description":"Once per round, may draw or holster an easily accessible weapon as an incidental.","type":"talents"},{"name":"Quick Draw (Improved)","description":"Twice per round, may draw or holster a weapon as an incidental.","type":"talents"},{"name":"Quick Fix","description":"Once per session, may make one skill check using Agility rather than the characteristic linked to that skill.","type":"talents"},{"name":"Quick Movement","description":"Before making a non-Force power check, may suffer 2 Strain to add {Force Rating} to the check; spend :forcepip::forcepip: to perform one free Move maneuver after the check is finished.","type":"talents"},{"name":"Quick Strike","description":"When performing a combat check, add {ranks|boost} against any target that has not yet acted in the encounter.","ranked":true,"type":"talents"},{"name":"Rain of Death","description":"Perform the Rain of Death maneuver to ignore the increased difficulty due to the Auto-Fire quality of attacks made this turn.","type":"talents"},{"name":"Rapid Reaction","description":"May suffer up to {ranks} Strain to add an equal number of :success: to any Vigilance or Cool check to determine initiative order.","ranked":true,"type":"talents"},{"name":"Rapid Recovery","description":"When recovering Strain at the end of the encounter recover {ranks} additional Strain.","ranked":true,"type":"talents"},{"name":"Ready for Anything","description":"Remove {ranks|setback} from mass combat made while the character is acting on the side of the acting force and the character’s Cool or Vigilance checks to determine Initiative order.","ranked":true,"type":"talents"},{"name":"Reconstruct the Scene","description":"Once per session as an action, may make a :hard: Perception check at a crime scene to identify all prominent physical characteristics of one person who was at the scene in the last 24 hours per :success:.","type":"talents"},{"name":"Redundant Systems","description":"Once per session, may make an :easy: MEchanics check to harvest components from a functioning device to repair a broken one, without breaking the functioning device.","type":"talents"},{"name":"Reflect","description":"When struck by a ranged attack but before apply­ing Soak, suffer 3 Strain to reduce damage by {ranks|plus-2}.","ranked":true,"type":"talents"},{"name":"Reflect (Improved)","description":"When struck by a ranged attack but before apply­ing Soak, suffer 3 Strain to reduce damage by {ranks|plus-2}. When reflecting a hit that generated :despair: or :threat::threat::threat:, may hit one target within Medium range dealing the same damage as the initial attack, after the original attack is resolved.","type":"talents"},{"name":"Reflect (Supreme)","description":"When struck by a ranged attack but before apply­ing Soak, suffer 3 Strain to reduce damage by {ranks|plus-2}. When reflecting a hit that generated :despair: or :threat::threat::threat:, may hit one target within Medium range dealing the same damage as the initial attack, after the original attack is resolved. If the character didn’t make a combat check during their previous turn, suffer 1 Strain instead of 3.","type":"talents"},{"name":"Researcher","description":"Remove {ranks|setback} from all Knowledge checks; researching a subject takes half the time.","ranked":true,"type":"talents"},{"name":"Researcher (Improved)","description":"On a successful Knowledge check, the character and allies receive :advantage::advantage: on future related checks, until the end of the character’s next turn.","type":"talents"},{"name":"Resist Disarm","description":"May suffer 2 Strain to avoid being disarmed or having a weapon damaged or destroyed.","type":"talents"},{"name":"Resolve","description":"When suffering Strain, reduce the amount suffered by {ranks}, to a minimum of 1.","ranked":true,"type":"talents"},{"name":"Respected Scholar","description":"Downgrade the difficulty of all checks to interact with institutions of learning {ranks|times}.","ranked":true,"type":"talents"},{"name":"Ritual Caster","description":"Must spend a maneuver before using any Force powers. In addition, may only use the Foresee power out­ doors and at night.","type":"talents"},{"name":"Saber Swarm","description":"As a maneuver, suffer 1 Strain to gain Linked {Force Rating} on the next Lightsaber (Agility) combat check.","type":"talents"},{"name":"Saber Throw","description":"Make a Lightsaber check against a target within Medium range, adding :force: up to Force rating: spend :forcepip: for attack to succeed and :forcepip: for lightsaber to return to hand.","type":"talents"},{"name":"Sarlacc Sweep","description":"As an action, make a Lightsaber combat check with +1 difficulty against one engaged target; spend :advantage::advantage: to hit one additional engaged target.","type":"talents"},{"name":"Savvy Negotiator","description":"May remove {ranks|setback} from all Negotiation and Streetwise checks.","type":"talents"},{"name":"Scathing Tirade","description":"As an action, make an :average: Coercion check; each :success: causes one enemy in Short range to suffer 1 Strain. Spend :advantage: to cause 1 affected enemy to suffer 1 additional Strain.","type":"talents"},{"name":"Scathing Tirade (Improved)","description":"As an action, make an :average: Coercion check; each :success: inflicts 1 Strain on a target in Short range. Spend :advantage: to inflict 1 additional Strain on one affected target; all affected targets suffer :setback: to all checks for {Coercion} rounds.","type":"talents"},{"name":"Scathing Tirade (Supreme)","description":"As an action, make an :average: Coercion check; each :success: inflicts 1 Strain on a target in Short range. Spend :advantage: to inflict 1 additional Strain on one affected target; all affected targets suffer :setback: to all checks for {Coercion} rounds. May suffer 1 Strain to perform Scathing Tirade as a maneuever.","type":"talents"},{"name":"Second Chances","description":"Once per encounter, may choose {ranks|words} positive dice in one skill check and reroll them.","ranked":true,"type":"talents"},{"name":"Second Wind","description":"Once per encounter, may recover {ranks} Strain as an incidental.","ranked":true,"type":"talents"},{"name":"Selective Detonation","description":"When using a weapon with the Blast quality, spend :advantage: to exclude one target that would normally be affected by the explosion. Multiple targets may be excluded up to ranks in Selective Detonation.","ranked":true,"type":"talents"},{"name":"Sense Advantage","description":"Once per session, may add :setback::setback: to the skill check of one NPC within Extreme range.","type":"talents"},{"name":"Sense Danger","description":"Once per session, remove :setback::setback: from any check.","type":"talents"},{"name":"Sense Emotions","description":"Add :boost: to all Charm, Coercion, and Deception checks unless the target is immune to Force powers.","type":"talents"},{"name":"Sense the Scene","description":"Once per session as an action, may make a :hard: Perception check at a crime scene, adding {ranks|Force Rating} to the roll. Spend :forcepip: to identify the emotional state of one person involved.","type":"talents"},{"name":"Share Pain","description":"When a bonded animal suffers Wound, as an incidental, may reduce the Wounds suffered by half (rounded up) then suffer an equal number of Wounds.","type":"talents"},{"name":"Shien Technique","description":"May use Cunning instead of Brawn when making Lightsaber skill checks.","type":"talents"},{"name":"Shortcut","description":"During a chase, add {ranks|boost} to any checks made to catch or escape an opponent.","ranked":true,"type":"talents"},{"name":"Shortcut (Improved)","description":"During a chase, add {ranks|boost} to any checks made to catch or escape an opponent and may suffer 2 Strain to add {ranks|success} to the check.","ranked":true,"type":"talents"},{"name":"Shroud","description":"Once per session, may spend one Destiny point to become undetectable via the Force and to make own Force powers unnoticeable.","type":"talents"},{"name":"Side Step","description":"As a maneuver may suffer up to {ranks} Strain to upgrade the difficulty of all ranged attacks targeting this character by 1 per Strain spent until the start of the character’s next turn.","ranked":true,"type":"talents"},{"name":"Signature Vehicle","description":"When in a starship or vehicle with functional coms, allies within Short range add :boost: to their Perception and Vigilance checks; allies within Close range add :boost::boost: instead.","type":"talents"},{"name":"Sixth Sense","description":"The character gains +1 ranged defence.","type":"talents"},{"name":"Skilled Jockey","description":"Remove {ranks|setback} from all Pilot checks.","ranked":true,"type":"talents"},{"name":"Skilled Slicer","description":"When making a Computers check, may spend :triumph: to gain some measure of control over the target system. Further Computers checks within this system can be made as maneuvers.","type":"talents"},{"name":"Skilled Teacher","description":"Before an ally at Short range makes a skill check, if that ally has fewer ranks in the skill than the character does, may, as an incidental, suffer up to {ranks} in Strain to add an equal number of :success: to the ally's next check.","ranked":true,"type":"talents"},{"name":"Sleight of Mind","description":"Add {ranks|boost} to Stealth checks unless the opposition is immune to Force powers.","type":"talents"},{"name":"Slippery Minded","description":"On any turn in which the character is under the effects of a Force power, as an action, may make a :hard: Deception check to no longer be under the effects of the Force power.","type":"talents"},{"name":"Smooth Talker (Charm)","description":"When making Charm checks, spend :triumph: to gain {ranks|success}.","ranked":true,"type":"talents"},{"name":"Smooth Talker (Coercion)","description":"When making Coercion checks, spend :triumph: to gain {ranks|success}.","ranked":true,"type":"talents"},{"name":"Smooth Talker (Deception)","description":"When making Deception checks, spend :triumph: to gain {ranks|success}.","ranked":true,"type":"talents"},{"name":"Smooth Talker (Negotiation)","description":"When making Negotiation checks, spend :triumph: to gain {ranks|success}.","ranked":true,"type":"talents"},{"name":"Sniper Shot","description":"Reduce difficulty of combat checks at Long or Extreme range by 1.","type":"talents"},{"name":"Soft Spot","description":"After a successful attack with a non-starship/vehicle weapon, may spend a Destiny Point to add {Cunning} to damage for one hit.","ranked":true,"type":"talents"},{"name":"Solid Repairs","description":"When repairing Hull Trauma on a starship or vehicle, repair +{ranks} Hull Trauma.","ranked":true,"type":"talents"},{"name":"Soresu Technique","description":"May use Intellect instead of Brawn when making Lightsaber skill checks.","type":"talents"},{"name":"Sound Investments","description":"Gain {ranks|multiply-100} credits at the beginning of each session.","ranked":true,"type":"talents"},{"name":"Spare Clip","description":"Does not run out of ammo on :despair:.","type":"talents"},{"name":"Speaks Binary","description":"When directing NPC droids, may grant them {ranks|boost} of Speaks Binary on all skill checks.","ranked":true,"type":"talents"},{"name":"Spitfire","description":"After making a successful check with two Ranged: Light weapons, each additional hit generated as part of the attack can be allocated to any other target within range of the weapon.","type":"talents"},{"name":"Stand Firm","description":"Once per encounter, the character may take the Stand Firm action, making a :hard: Leadership check. If the check is successful, the character chooses one ally within Medium range for each :success: on the check. Until the end of the encounter, chosen allies increase their wound threshold by an amount equal to the character's Presence rating. (Multiple uses of this talent are not cumulative).","type":"talents"},{"name":"Starship Adversary","description":"Upgrade difficulty of all combat checks against a ship this character is commanding {ranks|times}.","ranked":true,"type":"talents"},{"name":"Stalker","description":"Add {ranks|boost} to all Coordination and Stealth checks.","ranked":true,"type":"talents"},{"name":"Steady Nerves","description":"Remove {ranks|setback} from Cool or Skulduggery checks.","ranked":true,"type":"talents"},{"name":"Steely Nerves","description":"Spend one Destiny point to ignore effects of Critical Injuries on Willpower or Presence checks until the end of the encounter.","type":"talents"},{"name":"Stim Application","description":"May make an :average: Medicine check to increase the characteristic of one Engaged ally by 1 for the remainder of the encounter and cause them to suffer 4 Strain.","type":"talents"},{"name":"Stim Application (Improved)","description":"As an incidental, when performing the Stim Application action, may increase the difficulty to :hard: and reduce the Strain the target suffers to 1.","type":"talents"},{"name":"Stim Application (Supreme)","description":"When performing the Stim Application action , each :triumph: causes an additional characteristic to be increased by one.","type":"talents"},{"name":"Stimpack Specialisation","description":"Whenever the character uses a stimpack, the target heals {ranks} additional Wounds,","ranked":true,"type":"talents"},{"name":"Strategic Form","description":"While wielding a Lightsaber weapon, as a action, may make a :hard: Lightsaber (Intellect) check adding {Force Rating} to the dice pool. For each :success:, one target within Short range may only make combat checks targeting the character until the end of the following round. Spend :forcepip: to affeect a target for one additional round.","type":"talents"},{"name":"Street Smarts","description":"Remove {ranks|setback} from any Knowledge: Underworld or Streetwise checks.","ranked":true,"type":"talents"},{"name":"Stroke of Genius","description":"Once per session, may substitute Intellect characteristic on a skill check.","type":"talents"},{"name":"Strong Arm","description":"Treat thrown weapons as if they had one step greater in range, to a maximum of Medium range.","type":"talents"},{"name":"Stunning Blow","description":"May inflict damage as Strain instead of Wounds; does not ignore Soak.","type":"talents"},{"name":"Stunning Blow (Improved)","description":"May inflict damage as Strain instead of Wounds; may spend :triumph: on Brawl checks to stagger target for 1 round per :triumph:.","type":"talents"},{"name":"Sum Djem","description":"When making a Lightsaber combat check, may spend :triumph: or :advantage::advantage: to disarm the opponent. The weapon lands anywhere within Short range.","type":"talents"},{"name":"Sunder (Improved)","description":"Each :advantage: spent to activate a weapon's Sunder quality damages the item two steps instead of one.","type":"talents"},{"name":"Superior Reflexes","description":"The character gains +1 melee defence.","type":"talents"},{"name":"Surgeon","description":"When making a Medicine check to help a character heal wounds, the target heals {ranks} additional Wounds.","ranked":true,"type":"talents"},{"name":"Swift","description":"Do not suffer usual penalties for moving through difficult terrain.","type":"talents"},{"name":"Tactical Combat Training","description":"Melee and Ranged: Heavy become career skills.","type":"talents"},{"name":"Talk the Talk","description":"When making a Knowledge check, may spend one Destiny point to use Knowledge: Underworld or Streetwise for the required skill.","type":"talents"},{"name":"Targeted Blow","description":"After making a successful attack, may spend a Destiny Point to add {Agility} to damage for one hit.","type":"talents"},{"name":"Technical Aptitude","description":"Reduce the amount of time to complete computer-related tasks by 25% per rank.","ranked":true,"type":"talents"},{"name":"Terrify","description":"As an action, may make a :hard: Coercion check adding {Force Rating} to the dice pool. For each :success:, one target within Medium range is Disoriented until the end of the next round. Spend :advantage::advantage: to increase the duration for all affected targets by one round; spend :forcepip: to Immobilise an affected target.","type":"talents"},{"name":"Terrify (Improved)","description":"As an action, may make an :average: Coercion check adding {Force Rating} to the dice pool. For each :success:, one target within Medium range is Disoriented until the end of the next round. Spend :advantage::advantage: to increase the duration for all affected targets by one round; spend :forcepip: to Immobilise an affected target; spend :triumph: to Stagger an affected target.","type":"talents"},{"name":"The Force is My Ally","description":"Once per session may suffer 2 Strain to perform one Force power as a maneuver.","type":"talents"},{"name":"Thorough Assessment","description":"Once per session as an action, make a :hard: Knowledge check to gain :boost: equal to :success: that can be distributed during the encounter.","type":"talents"},{"name":"Time to Go","description":"Spend one Destiny point to perform a move maneuver as an incidental to attempt to move into cover or out of Blast range of a weapon or explosion.","type":"talents"},{"name":"Time to Go (Improved)","description":"Spend one Destiny point to perform a move maneuver as an incidental to attempt to move into cover or out of Blast range of a weapon or explosion. One ally at Engaged ranged may all also make a Move maneuver as an incidental.","type":"talents"},{"name":"Tinkerer","description":"Increase the number of hard points in {ranks|words} by one.","ranked":true,"type":"talents"},{"name":"Touch of Fate","description":"Once per session, may add :boost::boost: to any one skill check.","type":"talents"},{"name":"Tricky Target","description":"Any vehicle the character pilots counts as having a Silhoutte one lower than normal when being attacked, to a minimum of 0.","type":"talents"},{"name":"True Aim","description":"Once per round, may perform a True Aim maneuver to gain all the benefits of aiming and upgrade combat check {ranks|times}.","ranked":true,"type":"talents"},{"name":"Trust No One","description":"When targeted by a social check, may suffer 1 Strain to add :failure: to the check. If the check fails with :despair:, may immediately perform a maneuver as an out of turn incidental.","type":"talents"},{"name":"Twisted Words","description":"When a social check targeting the character generates :threat::threat: or :despair:, may suffer 1 Strain as an incidental to inflict {Coercion} Strain on the character who made the check.","type":"talents"},{"name":"Unarmed Parry","description":"May perform the Parry incidental when unarmed. Reduce the Strain cost when unarmed by 1 to a minimum of 1.","type":"talents"},{"name":"Uncanny Reactions","description":"Add {ranks|boost} to all Vigilance checks.","ranked":true,"type":"talents"},{"name":"Uncanny Senses","description":"Add {ranks|boost} to all Perception checks.","ranked":true,"type":"talents"},{"name":"Unstoppable","description":"If the roll for a Critical Injury is a 1 or is reduced to 1 the character does not receive the Critical Injury.","type":"talents"},{"name":"Up the Ante","description":"When gambling, win {ranks|multiply-10}% more credits.","ranked":true,"type":"talents"},{"name":"Utility Belt","description":"Spend one Destiny point to perform a Utility Belt incidental; produce a previously undocumented item or weapon (with restrictions) from a tool belt or a satchel.","type":"talents"},{"name":"Utinni!","description":"The character removes {ranks|setback} from checks made to find or scavenge items or gear. These checks could include Negotiation, Perception, or other checks. Such skill checks take half their normal time.","ranked":true,"type":"talents"},{"name":"Valuable Facts","description":"Make an :average: Knowledge check. If successful, add :triumph: to one ally’s skill check during the encounter.","type":"talents"},{"name":"Vehicle Combat Training","description":"Gunnery and Piloting: Planetary become career skills.","type":"talents"},{"name":"Walk the Walk","description":"May spend one Destiny point to add {Streetwise} damage to one hit of a successful Brawl check.","type":"talents"},{"name":"Well Rounded","description":"The character may choose two skills to become career skills.","ranked":true,"type":"talents"},{"name":"Well Travelled","description":"Knowledge: Core Worlds and Knowledge: Outer Rim become career skills.","type":"talents"},{"name":"Wheel and Deal","description":"When selling goods legally, gain {ranks|multiply-10}% more credits.","ranked":true,"type":"talents"},{"name":"Wise Warrior","description":"Once per round when making a combat check as an incidental, may spend one Destiny point to use any characteristic for the check.","type":"talents"},{"name":"Wise Warrior (Improved)","description":"Once per round when making a combat check as an incidental, may spend one Destiny point to allow the character and one ally at Short range to use any characteristic for the check.","type":"talents"},{"name":"Works Like a Charm","description":"Once per session, the character may make one skill check using Presence, rather than the characteristic linked to that skill.","type":"talents"},{"name":"Signature Spell","description":"When casting the specified signature spell, reduce the difficulty of the check by one.","type":"talents"},{"name":"Can't We Talk about This?","description":"This character can make an opposed Charm versus Discipline check targeting a character within medium range; if successful, the target cannot attack this character until the end of this character’s next turn; may spend :advantage::advantage: to increase the effect’s duration by one additional turn; this effect ends immediately if this character attacks the target","type":"talents"},{"name":"Bullrush","description":"When making a Brawl, Melee: Heavy, or Melee: Light combat check after using a maneuver to engage a target, may spend :advantage::advantage::advantage: or :triumph: to knock the target prone and move them up to one range band away from this character","type":"talents"},{"name":"Knack for It","description":"When acquired, choose 1 non-combat skill. Remove :setback::setback: when making that skill check. Choose 2 additional non-combat skills for each rank of Knack for It.","ranked":true,"type":"talents"},{"name":"Proper Upbringing","description":"When making a social skill check in proper, polite company, may suffer up to 2 strain to add up to {ranks|advantage} to the check","ranked":true,"type":"talents"},{"name":"Backstab","description":"May target an unaware target with a combat check using a Melee: Light weapon and the Skulduggery skill instead of the Melee: Light skill. If successful, the attack deals +2 damage per :success:, instead of +1.","type":"talents"},{"name":"Dark Insight","description":"Use Knowledge (Forbidden) to determine spell effects","type":"talents"},{"name":"Dual Wielder","description":"May perform a maneuver to reduce the difficulty of this character's next combined check to attack with two weapons during their turn by one.","type":"talents"},{"name":"Ruinous Repartee","description":"As an action, target a character within medium range and make an opposed Charm or Coercion check versus Discipline; if successful, target suffers 2 times {Presence} strain, +1 strain per :success:, and this character heals an equal amount of strain.","ranked":true,"type":"talents"},{"name":"Encouraging Song","description":"While using a musical instrument, select one target within medium range and make a :hard: Verse check. If the check is successful, for each :success: the target adds :boost: to their next skill check. For each :advantage, the target heals 1 strain.","type":"talents"},{"name":"Chill of Nordros","description":"Magic attacks gain the Ice effect with no increase in difficulty, but can never add the Fire effect.","type":"talents"},{"name":"Flames of Kellos","description":"Magic attacks gain the Fire effect with no increase in difficulty, but can never add the Ice effect.","type":"talents"},{"name":"Necromancy","description":"When this character uses the conjure magic action, it gains the Summon Ally effect with no increase in difficulty; all creatures the character summons must be undead.","type":"talents"},{"name":"Whirlwind","description":"May suffer 4 strain to use this talent to make a Brawl, Melee (Light), or Melee (Heavy) attack against the engaged adversary who is hardest to hit (as determined by the GM), increasing the difficulty by one. If the combat check succeeds, each adversary engaged with the character suffers one hit from the attack, that deals base damage plus damage equal to the total :success: scored on the check.","type":"talents"},{"name":"Duelist","description":"Add :boost: to Melee combat checks when engaged with a single opponent, but add :setback: when engaged with three or more opponents.","type":"talents"},{"name":"Distinctive Style","description":"May add :success::success::threat::threat: to any Computers (Hacking) check before rolling; :threat::threat: trigger the I Know You! result in Table 3-2 on SotB page 130.","type":"talents"},{"name":"Grenadier","description":"When making a combat check using a weapon with the Blast quality; may spend one Story Point to trigger Blast instead of spending :advantage: (even if the attack misses); in addition, treats grenades as having a range of medium.","type":"talents"},{"name":"Nethunter","description":"When this character successfully traces another character during a Network encounter, they gain one additional trace.","type":"talents"},{"name":"Snare","description":"Once per session, may spend an action and make a :hard: Computer (Sysops) check; if successful, once before end of the current Network encounter; the GM may spend a Story Point to force one character in the Network encounter to make a :daunting: Vigilance check as an incidental; if they fail, they are staggered until the end of their next turn, plus one additional turn per :threat::threat:.","type":"talents"},{"name":"Probing Question","description":"If this character knows her opponent's Flaw or Fear and inflicts strain on them using a social skill, the opponent suffers 3 additional strain.","type":"talents"},{"name":"Clever Retort","description":"Once per encounter, may add :threat::threat: to another character's social skill check.","type":"talents"},{"name":"Customer Service Experience","description":"After making a Charm check, may suffer up to {ranks|strain} to cancel an equal amount of :threat:.","ranked":true,"type":"talents"},{"name":"Hamstring Shot","description":"Once per round, may perform a ranged combat check against one non-vehicle target within range; on a success, halve the damage inflicted (before applying soak); the target is immobilized until the end of its next turn.","type":"talents"},{"name":"Berserk","description":"As an incidental, until the end of the encounter, may add :success::advantage::advantage: to all melee combat checks, but cannot make Ranged attacks; enemies add :success: to all combat checks targeting this character; when this talent is used, suffer 6 strain at end of encounter.","type":"talents"},{"name":"Combat Medicine","description":"Before making a medicine check, may use this talent to add {ranks|success} to the results; after the check is resolved, the target suffers {ranks|multiply-2} strain.","ranked":true,"type":"talents"},{"name":"Drone Master","description":"This character may control up to two drone rivals or a minion group of four drone minions; may spend a maneuver to allow each rival or minion group under their control to perform an action and a maneuver during this character's turn.","type":"talents"},{"name":"Laugh It Off","description":"When this character is targeted by a social skill check, they may spend :threat::threat::threat: or :despair: to reduce any strain the check inflicts by 5, then cause their opponent to suffer strain equal to the amount reduced.","type":"talents"},{"name":"Lucky Strike","description":"After making a successful combat check, may spend a Story Point to add 4 damage to one hit","type":"talents"},{"name":"Indomitable","description":"Once per encounter when incapacitated, may spend a Story Point to use this talent; then, this character is no longer incapacitated (and cannot become incapacitate) until the end of their next turn.","type":"talents"},{"name":"Defensive Sysops","description":"When defending a computer system against intrusion, add :setback::setback: to opponents' checks.","type":"talents"},{"name":"Defensive Sysops (Improved)","description":"When defending a computer system against intrusion, add :failure::threat: to opponents' checks.","type":"talents"},{"name":"Determined Hunter","description":"After successfully tracing another character during a Network encounter, gains one additional trace.","type":"talents"},{"name":"Burn Through","description":"After making a successful check to override a piece of ice, may suffer 3 strain to attempt to override a second piece of ice on the same system as an incidental.","type":"talents"},{"name":"Net Warrior","description":"When using a BMI, may make an opposed Computers (Hacking) versus Computers (Sysops) check targeting one character accessing the system; the target suffers 1 strain per :success:, and if they are uising a BMI, they also suffer 1 wound per :success:.","type":"talents"},{"name":"Determined Driver","description":"When driving or piloting a vehicle, may spend a Story Point to have the vehicle heal 4 system strain.","type":"talents"},{"name":"Offensive Driving","description":"When driving or piloting, may make an opposed Driving or Piloting versus Driving or Piloting check versus the driver or pilot of one other vehicle in medium range. If successful, roll two Critical Hit results, choose one to apply to this character's vehicle and one to the target vehicle. :triumph: adds +20 to one result, :despair: adds +20 to both results.","type":"talents"},{"name":"Deadeye","description":"After inflicting a Critical Injury and rolling the result, may suffer 2 strain to select any Critical Injury of the same severity to apply to the target instead.","type":"talents"},{"name":"Unremarkable","description":"Other characters add :failure: to any checks made to find or identify this character in a crowd","type":"talents"},{"name":"Good and Bad Cop","description":"May spend :advantage::advantage: from Charm, Coercion, Deception, or Negotiation check to upgrade the ability of an ally's social skill check targeting the same character once.","type":"talents"},{"name":"Code Slinger","description":"When performing the activate program maneuver in a hacking encounter, may choose not to deactivate one other active icebreaker; may have two icebreakers active at once.","type":"talents"},{"name":"You Owe Me One","description":"Once per session, you may spend one Story Point to have one other character in the encounter owe this character a small favor for past services performed by this character or their organization.","type":"talents"},{"name":"Forgot to Count?","description":"When targeted by a ranged attack, can spend :threat::threat: to cause attacker to run out of ammunition.","type":"talents"},{"name":"Street Fighter","description":"When disorienting or knocking a target prone, the target suffers 3 wounds.","type":"talents"},{"name":"Takedown","description":"May make an opposed Brawl vs. Resilience check targeting one engaged opponent. If successful, target is knocked prone and immobilized until end of this character's next turn.","type":"talents"},{"name":"Bad Habit","description":"May spend a maneuver and become disoriented until the end of the encounter; at the beginning of each subsequent turn during the encounter this character heals 2 strain.","type":"talents"},{"name":"Applied Research","description":"{ranks|times} per session may use Knowledge (Science) and Intellect when making a check instead of the skill and characteristic the check would normally require.","ranked":true,"type":"talents"},{"name":"Big Guns","description":"This character has an encumbrance capacity of 12.","type":"talents"},{"name":"Haughty Demeanor","description":"Other characters add :threat: to social skill checks targeting this character.","type":"talents"},{"name":"Counteroffer","description":"Once per session may choose one non-nemesis opponent with in medium range and make an opposed Negotiation versus Discipline check. If successful, target becomes staggered until the end of their next turn (or for remainder of encounter if successful with :triumph:).","type":"talents"},{"name":"Daring Aviator","description":"Before making a Driving or Piloting check, may add up to {ranks|threat} to the check to add an equal number of :success:.","ranked":true,"type":"talents"},{"name":"Archaic Arms Master","description":"While armed with a Melee weapon, may make an :average: Melee check to force one engaged target to drop one weapon or move one range band in any direction.","type":"talents"},{"name":"Eagle Eyes","description":"Once per encounter before making a ranged combat check, this character may increase their weapon’s range by one range band (to a maximum of extreme range); this lasts for the duration of the combat check.","type":"talents"},{"name":"Animal Companion","description":"Has a silhouette {ranks|minus-1} animal companion; once per round, may spend a maneuver to direct the animal to perform one action and one maneuver during this character's turn.","ranked":true,"type":"talents"},{"name":"Barrel Roll","description":"When piloting a starfighter or air-plane of silhouette 3 or less, after suffering a hit, may suffer 3 system strain to reduce the damage by four as an incidental.","type":"talents"},{"name":"Devourer","description":"Once per encounter, if the vine is engaged with an incapacitated target that is compatible with its carbon-based diet, it may use this talent to heal {ranks|plus-2}.","ranked":true,"type":"talents"},{"name":"Mad Inventor","description":"Once per session, make a Mechanics check to cobble together the functional equivalent of any item using spare parts or salvage, as per Table 1.4-1 Mad Inventor Item Rarity on page 80 of the Genesys Core Rulebook","type":"talents"},{"name":"Dramatic Entrance","description":"Once per session, may spend a Story Point to use this talent to enter a scene or encounter they are not currently participating in at an opportune time, no matter how unlikely their arrival. If the scene is a combat encounter or otherwise uses Initiative order, add a new Initiative slot at the top of the Initiative order.","type":"talents"},{"name":"Wallcrawler","description":"Can move across vertical surface as easily as horizontal surfaces. In addition, when this character attempts to reduce the damage taken from falling, reduce the difficulty of the Athletics or Coordination check by one.","type":"talents"},{"name":"Heightened Awareness","description":"Allies within short range add :boost: to Perception and Vigilance checks, engaged allies add :boost::boost: instead.","type":"talents"},{"name":"Implacable","description":"When this character is targeted by a social skill check, they reduce any strain they suffer as a result of that check by {ranks}.","ranked":true,"type":"talents"},{"name":"Artificial","description":"Does not suffer penalties for moving through difficult terrain.","type":"talents"},{"name":"Bowl Over","description":"When making a melee attack after engaging a target, may activate the Knockdown item quality without spending :advantage:","type":"talents"},{"name":"Let's Ride","description":"Can mount or dismount from an animal as an incidental.","type":"talents"},{"name":"Sharp Tongue","description":"May reduce the number of :advantage: they must spend to inflict a critical remark in a social encounter by {ranks} to a minimum of one :advantage:.","type":"talents"}]